{
  "Domain": "Supplements: Personal Reality",
  "Over_Domain": "Supplements",
  "Perks": [
    {
      "Title": "A Classy Classroom",
      "Cost": 0,
      "Description": "This provides your Reality with a large classroom for you and your companions to use for teaching and learning new things. It is outfitted with all the basic classroom equipment like tables and writing boards. If you’ve Got the Powa, this includes A/V set ups and personal computers, and with Pipes Pipes Pipes it includes lab equipment. With any of the Food Options it includes cooking tutorial equipment, with a Med Bay it includes first aid and medical education supplies, with workshops it includes a teaching workshop of the same kind. Whenever you acquire new technology that could be beneficial to teaching, the Classroom automatically up dates to include it if you have Central Control. Also provides basic supplies for all students and slightly boosts teaching aptitude for the teacher, as well as learning speed and concentration for students. All possible safety equipment is automatically installed at no extra cost. Each classroom can seat up to 50 students comfortably. If you have Jump Recording, the classroom can replay all previous classes for new students.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 0,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "A Little Less Basic",
      "Cost": 50,
      "Description": "[Requires: Basic Nutrition] Although not a huge improvement, this raises the basic food allotment to what can be expected for a middle class working family’s budget. You can set it to the kinds of things your home culture might buy... or simply set it to a random sampling of various cultures’ food purchases. Honestly, it’s fascinating seeing what people buy. Check out Hungry Planet if you can. This is effectively 150 dollars US (c2020) a week per person, adjusted for cost of living and whatnot. You have very limited brand control.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 1,
      "Prereq": true,
      "Prereq_Title": "Basic Nutrition",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "A Lot Less Basic",
      "Cost": 100,
      "Description": "[Requires: A Little Less Basic] This upgrade gives you specific cultural (rural France in the 1880s, Moscow under the communists, biblical Israel, etc.) and general purchasing breakdown (X% grains, Y% junk food, Z% fresh fruits, etc.) plus raises the food budget to 300 US dollars (c2020) purchasing power per person per week. Each week you can change what kind of food delivery you get and where it comes from, including any culture you’ve jumped into along your travels. This still does not give you direct control of what you get, just a general batch of stuff that fits your requirements. You can specify brands you’d like, however.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 2,
      "Prereq": true,
      "Prereq_Title": "A Little Less Basic",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "A Month",
      "Cost": 50,
      "Description": "[Requires: A Week and A Button] The Week has been replaced with a Lunar Cycle/Month. 28 Standard Days.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 3,
      "Prereq": true,
      "Prereq_Title": "A Week and A Button",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "A Month’s Return",
      "Cost": 100,
      "Description": "[Requires: A Month] This up grades the Month so you can now return to any world you’ve ever jumped to for a month between jumps. This does not extend the time between jumps, nor does this count against or for other Vacation or Return Options. This cannot be used to visit your home reality until you have either decided to Stay or earned your Spark. Obviously, if you ever Go Home or Chain Fail, you can use this to continue visiting old worlds you once visited.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 4,
      "Prereq": true,
      "Prereq_Title": "A Month",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "A Range of Ranges",
      "Cost": 50,
      "Description": "This adds a high tech shooting range to your Personal Reality so that you and your companions can practice your marksmanship in a safe environment. The shooting range comes with an unlimited supply of fully functional but harmless copies of any ranged weapons you’re familiar with. They have the exact same weight, balance, and accuracy. They fire self-cleaning, guaranteed no-stain paint balls or stinger bullets (ones that hurt a bit, but cannot do damage) at your discretion. These duplicates are colored like nerf weapons so you don’t get them confused if you accidentally take them out of the Range. If you also have the Underside or Gym-Nasty-Um, you get a self-reconfiguring laser-tag arena for free. If you have both you automatically get an urban combat training course that changes every week. If you have the Tree-line upgrade, you get an outdoor shooting range/wilderness combat training ground. If you also have Environmental Controls, you can change the terrain and climate inside this zone. The size of the laser-tag arena, urban combat training course, and wilderness combat training ground depends on how much space you have. If you’re running with only Starting Size, they are going to be 40 m on a side and 2 stories tall. Every size expansion applies to the arenas as well, doubling the height and multiplying the footprint by x100 (400 m x 400 m x 4 stories, 4 km x 4 km x 8 stories, and so on.) If you have the Housing Complex’s Commons, every Commons gains its own shooting range. To keep things from getting ridiculous, you can set areas of your Personal Reality where these weapons will not work at all. Of course, that’ll just force the pranksters to get creative, but it’s there if you want it.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 5,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "A Room For Your Trophies and Cigars",
      "Cost": 0,
      "Description": "A spacious chamber set up for you to aesthetically showcase the various trophies and rewards you will gather on your chain. It keeps them safe and from causing harm or from decaying.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 6,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "A Stellar Nursery",
      "Cost": 100,
      "Description": "[Requires: (Housing Complex || Medical Bay)] Planning on starting a family? Just enjoy collecting infants? Either way, this is for you. The Nursery comes with all the equipment needed to deal with a (theoretically transfinite) number of infants and toddlers. It even has uterine replicators just in case no one wants to get fat or have to deal with all the pushing and screaming. The Nursery Upgrade will either be a stand alone Medical Facility or will hook each house up with its own smaller nursery. If you have food supplies, they will be adapted to the optimal dietary needs of the children, and packaged into child-friendly packages. If you have robots, diaper-changing robots will be included. Otherwise, the furniture in the nursery is dependent on the quality of your housing and is guaranteed child-safe and friendly.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 7,
      "Prereq": true,
      "Prereq_Title": "(Housing Complex || Medical Bay)",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "A Week and A Button",
      "Cost": 0,
      "Description": "You may, at the end of each jump, take 7 Standard Earth Days off before entering your next jump. A button is provided so you can end this downtime whenever you so desire. Dying in this period is still dying and will burn a 1-up from the jump you just finished if possible, then from the next jump if available.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 8,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Access Key",
      "Cost": 0,
      "Description": "This is a special key which lets you access your Personal Reality and its contents. When inserted into any lock on any door, the door opens to reveal a gateway into your Reality at a predetermined location within it. You are the only person who can take the key from the lock, the gateway remains open as long as the key is in the lock, and if key is ever lost or stolen you will find it in your pocket a few minutes later. You cannot close the door as long as you are inside the Personal Reality.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 9,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 50,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Adapt Or Adaptation",
      "Cost": 0,
      "Description": "[Requires: The Garage of the Gods] Multiple Purchases Allowed. If six free adaptors per VEH isn’t enough for you, there might be something wrong with you, but each purchase of this gives you three more adaptors per VEH per Jump.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 10,
      "Prereq": true,
      "Prereq_Title": "The Garage of the Gods",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Adaptive In Active Storage",
      "Cost": 200,
      "Description": "[Requires: Starting Space] This upgrade means that your Warehouse will automatically gain a special customized storage space for anything you purchase with CP... But what’s so good about that? This storage space is in active. That means anything in it isn’t out in a Host Reality, it isn’t out in your Personal Reality. The stuff cannot be Inter acted with in any way except to pull it out of In active Storage... if you have the space to do so. So if it doesn’t fit inside some part of your Personal Reality that can be used for storage, then that item is only accessible if you bring it out of in active storage into a Host Reality. This allows you to decide if something like your personal continent will be subjected to whatever nastiness is in a given Host Reality. Anything can be put into in active storage between jumps.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 11,
      "Prereq": true,
      "Prereq_Title": "Starting Space",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Additional Keys",
      "Cost": 50,
      "Description": "[Requires: Access Key] Multiple Purchases Allowed. This gives you additional keys to your Personal Reality. These keys attune to whomever you give them to and cannot be used by anyone other than them or someone they freely and without duress or coercion of any kind allow to use the key. If they lose the key, it will return to them if they are still alive, or to you if they are currently dead. If they die in possession of the key, their body will be transported to your Medical Bay, if you have one. 50 CP for 1 Key.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 12,
      "Prereq": true,
      "Prereq_Title": "Access Key",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Additional Space",
      "Cost": 200,
      "Description": "[Requires: Starting Space] Multiple Purchases Allowed. This upgrade expands your Personal Reality by a factor of 10 in each dimension... or rather the standard three dimensions, you rabid cheese lord. Additional Space also up grades various expansion options. The first purchase of this brings you to 64 Million Cubic Meters, then 64 Billion Cubic Meters, then 64 Trillion Cubic Meters, so on and so forth. Earth’s volume, for reference, is 1 Hexillion Cubic Meters and its surface area is 510 Quadrillion Square Meters. Cover the Earth in storage facilities 100 meters high and you get 51 Quintillion Cubic Meters of Storage space.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 13,
      "Prereq": true,
      "Prereq_Title": "Starting Space",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Advanced Thematics",
      "Cost": 50,
      "Description": "Would you like all the expansions you buy for your Personal Reality to conform to some theme you’ve already purchased? Or to one of the themes you’ve already purchased? Or a random carousel of the themes you’ve purchased? Or do you just want your expansions not to clash with everything you’ve built? If you buy this without getting one or more purchases of Basic Thematics, all your purchased Reality Expansions will conform to the basic aesthetic you’ve established in your Reality and will shift over time as you change that aesthetic. If you have Basic Thematics, you can choose which theme is applied to which expansion and to what degree. Without Central Control, you get this option only when you first buy the expansion. With it, of course, you can change theming at will. Theming is almost completely cosmetic.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 14,
      "Prereq": true,
      "Prereq_Title": "Basic Thematics",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "All Your Peeps",
      "Cost": 600,
      "Description": "Multiple Purchases Allowed. Well, maybe not ALL. Some of your Peeps. One. One of your Peeps. Or More. One or More of your Peeps. Unless you buy the unlimited Plan. Then it really is ALL of your Peeps. What’s that? You don’t know what a Peep is? A Peep is a homey. A friend. A person of emotional significance to you. Anyway, buy this and you get a 15 minute window to convince anyone you knew from your Pre-Jumper life to join you on your journeys. You have to do so using absolutely no Perks, Powers, Stat Boosts... nothing you didn’t have the last time you talked to them (except memories. You can have memories. And if you had speech impediments or other communication troubles, those can be cleared up.) Anyway, your 50 WP gets you 15 minutes and a guarantee that, if anyone interferes with your attempt, that interference won’t count against your time limit. So, yeah, if you’ve got one of those friends who won’t put down their cell phones to listen to you or something like that, you won’t be was ting your time. Your attempt will be held at the last place you saw that person, and will be right after you left your Pre-Jumper life. You won’t be able to offer them any tangible proof at all, and you can’t phrase it as a hypothetical. You have to convince them that you’re serious and that the offer is real. Yes, it’s a small window. Yes, it’s a challenge. Each purchase allows you to try once, and only once, on a singular individual. If they say no, their memory of your attempt will be erased, and the purchase will allow you to try again on a different individual. If that person also says no, their memory of the attempt will also be erased and you’ll get one last try with a third person. If they say no as well, you’re out the WP and their memory of the attempt is gone. Another purchase will not allow you to try again with the same individual. Why? Because eventually you’d just pester them into saying yes to get you to go away! The unlimited plan, of course, gives you an unlimited number of invites and an unlimited number of recruitments. It’s unlimited. But you still can’t try multiple times on the same individual. If you want to try multiple times with the same individual, you’ll need to have the unlimited Plan and then buy individual attempts at 50 WP each. Those aren’t three strikes, you’re out. Those are each 50 WP for every try, though they’ll only forget your attempts until you make the next one. Regardless of your plan, each attempt does roll your home reality’s time forward 15 minutes.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 15,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "All Your Pets",
      "Cost": 0,
      "Description": "[Requires: All Your Stuff] You want to bring your dog along, as well as the cat that was a family pet? Goldfish, other fishes, a pair of horses, that hamster you rescued from being duct-taped... Slow down! Any animal that you were personally the owner of, or that you could be considered its significant part-owner, like a family pet cat, you can now bring along as well. Any animals brought along this way will be kept in the prime of their lives and healthy, and should they manage to get themselves killed they will be restored back to life and full health in 24 hours. Does not come with any food for them, though, so you will need to figure out something else for this. Other requirements of All Your Stuff apply. This will restore pets that passed on before you started on the chain to life just before restoring them to the prime of life condition, but their memories (such as they have memories) will be of their entire lives, though they will not be traumatized by the way it ended, just pleasantly surprised to be feeling healthy and whole again.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 16,
      "Prereq": true,
      "Prereq_Title": "All Your Stuff",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "All Your Stuff",
      "Cost": 100,
      "Description": "This nifty little one time purchase allows you to bring everything you owned back in your Origin Reality with you and gives it fiat backing. Note that this not only includes everything you owned just prior to your Jump start moment, but everything you’d ever owned prior to that moment. Does not include consumable/disposable items such as fuel, food, health-care products, or non-collectable cash. It also excludes land, businesses, and homes... but not any of the furnishings, so you’d end up with cabinets and sinks and fixtures. Included are all items that you would be considered a significant part-owner, such as, say, for instance, the family entertainment center, or the family car, or grand pa’s ashes. It wouldn’t include things like ‘your mom’s car’ that she bought when you were sixteen after she gave you her old junker or things that you were only the de-fact o owner of, like your company’s car that was given to you for your use. Also excluded are anything you own shares of. You’d keep your shares for all they’re worth, but not be able to, say, bring along the Ford Motor Company simply because you own a thousand B-Shares. Very specifically, no living beings other than plants are included, at all. Not even viruses. Thank fully, stuff that is clearly garbage will not be included, but if you’d value it and you owned it, it’ll show up, as good as new... unless you want it in a specific condition for some reason. Anything you have ordered/preordered/kick started before your departure date is included as well. Any digital property will be provided in fully usable format, even if it would normally require servers. No up dates past your departure date will be included.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 17,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "An Intervention",
      "Cost": 800,
      "Description": "[Requires: Power Overwhelming] Well, okay. you asked for it. We need to have a talk about how you’re u sing this much energy. Congratulations. With this upgrade, your warehouse now produces as much raw energy as you need to run all your devices... yes, even if that’s a billion UWS (Universe Watts Per Second... or as much energy as an entire Universe contains per second). Seriously though, you need help.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 18,
      "Prereq": true,
      "Prereq_Title": "Power Overwhelming",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Antibiotic Field",
      "Cost": 0,
      "Description": "You would have to be an idiot not to take this. See, every biological life form carries their own microbiome and something called a virome (the viral version of bio me) inside us. They’re harmless to us... often helpful in fact. But expose someone to bacteria, protozoa, or virus particles that they’re not used to and you’ve just given them the plague. This stops this from happening. The microbiome of everyone who enters or exits your PR is scrubbed to be harmless to everyone in each jump you visit. This doesn’t kill your virome/biome, just keeps it from being harmful... to anyone. All viruses, parasites, and bacteria not native to your current jump and not in specifically designed storage containers (or fiat backed) are destroyed at the end of each jump or passage to a new reality if you’re post chain. The biomes/viromes of companions and jumpers inside the PR at jump transition are converted to local versions at the start of the next jump. No one likes a plague carrier. This will not cure current infections except at the ends of jumps. But if you need that, there’s a medbay later on. You probably want that.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 19,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Automated Weapons Security System",
      "Cost": 200,
      "Description": "[Requires: Central Control] Adds automated weapon security systems to your Personal Reality. Useful for keeping invading enemy forces from easily overwhelming systems or personnel. You’ll need to supply the weapons, but this will provide ammo and targeting systems for the shooting and maintenance and repairs for between the shootings. These weapons will not fire on a Key holder... but can fire very very very close to a Key holder.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 20,
      "Prereq": true,
      "Prereq_Title": "Central Control",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Baf and Booty Works",
      "Cost": 0,
      "Description": "[Requires: Wellness Center] What’s a Wellness Center without a Spa and Roman Baths? This facility provides you with a huge sauna (with or without large burly Russians or Finns to beat you with leaves) including a large snowdrift and ice pond to jump into after your steam, as well as a dozen different Ro man-style, Japanese-Style, and Chinese-Style bathing pools of all different temperatures to relax in. Guaranteed to be cleaner than clean and extremely foggy.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 21,
      "Prereq": true,
      "Prereq_Title": "Wellness Center",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Basic Accommodations",
      "Cost": 50,
      "Description": "This provides minimalist accommodations for you and each companion. Essentially the same thing you’d get in Basic Training in the military. A bar racks with a bunk and a locker and a camp toilet. If you bought Pipes Pipes Pipes, this improves to include a communal shower and toilets. In fact, someone need not be a companion for this to work. Anyone you allow into your Personal Reality will be allotted a similar level of basic living quarters, thus allowing you to turn your Personal Reality into a refugee center if you like. If you have Basic Nutrition, this will provide any such guests as you may invite into your Personal Reality with very basic food equal to 2000 Kc a l a day, totally vegetarian. This can support up to a maximum of one person per day for every 4 cubic meters of space in your warehouse. Camp toilets must be emptied manually. No extra space is added to your Personal Reality by this. It simply provides food and bed and toilets for as many people/beings as you have in your Personal Reality at any given time.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 22,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Basic Nutrition",
      "Cost": 50,
      "Description": "This option provides a basic (if minimalist) food delivery for you and all companions (metered for a normal human dietary requirement). This delivery comes once a week and is the kind of thing you’d buy on a very strict budget; Ramen, Peanut Butter, Generic Cereal, Dry Beans, Eggs, Tofu, Fresh Common Fruits and Veggies, Canned Fruits and Veggies, Dry Pasta, Salt, Pepper, Milk, Bottled Water, Rice, Flour, Butter, Barley, etc. Essentially the purchasing power of 50 dollars US a week per person. (Note, you cannot sell these supplies for money.)",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 23,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Basic Thematics",
      "Cost": 0,
      "Description": "Multiple Purchases Allowed. Are you bored with bland metal walls and plane cement floors? Did you buy Treeline and Timber but you really wanted an ethereal fantasy forest instead of old growth pines? Did you pick up Realistic Ground Cover, but you really wanted glowing pebbles and slightly rubbery micro-mushrooms? This option is for you. You may purchase one overarching cosmetic theme for your Personal Reality and have it apply to everything you get from this document. This theming conveys no particular advantages, but can definitely make the place feel more like a home. These themes are not just visual. They’re a complete sensory package. Multiple purchases of this are allowed, allowing you to choose which elements of your Personal Reality are bound to which theme. With Central Control, you can switch between themes at will. When you first purchase this, you have 24 hours to customize your thematic elements before they are locked down and cannot be changed except when you make another purchase of this, at which point you gain a total of 24 hours to customize or re-customize all your Basic Thematics.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 24,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Boxes and Boxes and Boxes",
      "Cost": 0,
      "Description": "Would you like some boxes? Have as many as you need. Crates? Those too. Bags? Absolutely. Kegs? Barrels? Vats? Plastic toes? As long as it’s a completely mundane and fairly generic storage container, you can have as many as you need... but only for storage containers and you’re not allowed to sell them or use them as raw materials... unless you’re making a cool cardboard fort. That’s totally allowed. To access this supply, simply go to the door in the back corner of your PR marked “Box Office” and fill out a request form. Your storage container will arrive within 30 minutes at your Entry Hall. These containers are in no way fiat backed. They are completely normal.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 25,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Calendar Change",
      "Cost": 100,
      "Description": "Do you find it odd that a Jumper who travels all over... everywhere, is still bound to the Earthly Calendars? What about a Mayan, Chinese, Islamic, or Jewish Jumper? What about a Martian Jumper? Well, with this option, your chain now uses a calendar that can range from 360 to 400 days long and those days can be anywhere from 20 to 30 hours long. This won’t change the length of local planetary days (those are set by astrophysics or the local equivalent) but will change how long your jumps are and how all your clocks function. Any device with a clock on or in it will gain a setting allowing it to display Personal Reality Time... except purely clockwork clocks for some reason. This does not change the length of a second. A Standard year contains 31,557,600 seconds. This means the minimum length the Jumper’s Year can be set to is almost exactly 300 Earth Days and the maximum length is just under 500 Earth Days. Because the hardest part of using a different Calendar is remembering all the fiddly bits, you and all followers and companions gain an understanding of your calendar and knowledge of how to convert it back to standard. Of course, your Calendar can actually fall wildly outside the 300-400 day, 20-30 hour range... say by having your Year be set to the length 666 Cycles and be exactly as long as 1 Standard Decade... but the number of actual standard seconds must fall between 21,600,000 and 43,200,000.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 26,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Central Control",
      "Cost": 100,
      "Description": "This ho oks your Personal Reality up with a Smart Pseudo-Intelligent Computer System that tracks the location and condition of all items brought into the Personal Reality. It will share that information with you or anyone you authorize to use the system. They do not have to have a key and you can set up varying levels of access. Central Control can also recall your companions to the Personal Reality if you have Portal and command it to or they are killed and you’ve set up automated recall. It can open your Personal Reality Door from the inside if you’ve given it permission to do so, but will only admit those it believes will assist you. It can only open doors on which Access Key has been used on, but the key need not be still in that door for the door to be opened.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 27,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Choice Apartments",
      "Cost": 200,
      "Description": "[Requires: Housing Complex] Multiple Purchases Allowed. There’s nothing quite as divisive as preferential treatment... but it does serve to show who you like better than others. Each purchase of this up grades exactly one third of all your Basic Housing Units in several minor ways. First off, two bedrooms can now be merged into a Master Bedroom, which has its own walk-in closet and attached bathroom. Second, the floors are now either carpeted or wood paneled, walls are wall papered, all rooms are 50% large r, the cut off for additional kitchens is lowered to every five people and the furniture is decent. Kitchen Appliances, bathroom fixtures, closet doors... everything is improved a bit. The walls are now drywall and metal frame with insulation. Not soundproof, but better than nothing. closets are now adequate and installed in each bedroom. Who gets to live in a Choice Apartment is entirely up to you... unless you buy this thrice, at which point, all your units are Choice. Choice Units are always on higher floors than Base Units.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 28,
      "Prereq": true,
      "Prereq_Title": "Housing Complex",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Cleaning Supplies",
      "Cost": 0,
      "Description": "Infinite supply of any cleaning supplies you might need for cleaning your Personal Reality. By default placed into a specific closet, but can be placed elsewhere. These have no actual chemical properties. No using this to get an endless supply of brooms or bleach. Completely safe for all complex lifeforms. Very not safe for viruses, bacteria, amoeba, or household pests.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 29,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Companion Calibration Unit",
      "Cost": 0,
      "Description": "While not a full Body Mod for your companions, this is perhaps the next best thing. Taking the form of a vending machine-sized diagnostic cabinet, this scans your companions (and all their alt-forms) for any form of illness, genetic malady, or physical/neurological dysfunction and corrects them. It also provides a statistical analysis of their baseline (i.e. what they'd be like powered down). This second function can be used on non-companions.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 30,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 100,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Companion’s Stuff",
      "Cost": 500,
      "Description": "A Companion may take one or more personal draw backs valued at 500 CP total, over one or more jumps (a personal drawback is herein defined as one that will impact the taker, not the world-state). They gain Zero CP for that/those drawback(s), but once they cross the 500 CP value threshold they earn a copy of All Your Stuff/All Your Pets that applies to their own previous belongings. The same restrictions of property, buildings and cash apply, so companioning Hal Jordan to get the Oan Main Power Battery with this will not work since he is in possession of it only due to his job. In addition to these previous restrictions, this companion version also blocks out any weapons, star ships, or magical items more powerful than anything the Jumper already owns. This does not in any way affect or limit stuff that Companions already bring with them when they get recruited, that part is entirely under your purview.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 31,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Computer Hub",
      "Cost": 50,
      "Description": "A top-of-the-line mainframe/supercomputer with basic additional equipment, like scanners (2D and 3D, standard-and poster-size d) and printers (color, black and white, bulk printer, 3D printer, blue print-printer), and binding equipment. Perfectly assimilates any up grades done to it. Comes with the operating system of your choice, be it Windows, Linux, Android, iOS, etc. You and each Companion receive their own personal desktop computer, laptop, and tablet. If you have Central Control and Robots, they’re linked into an internal Intranet. With the Extranet, all the computers in the Personal Reality are linked to the Internet as well. All printing supplies (filament, paper, ink) must be supplied by the Jumper, but if you have the Mall, you can always find a print supply shop within without having to assign one of your slots to it. This is not an extension. You’ll have to make space in your PR for it.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 32,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Connecting Doors",
      "Cost": 0,
      "Description": "These doors come in pairs and can connect any two parts of your Personal Reality and only parts of your Personal Reality. Locking one door locks both. They appear as tarot-sized playing cards and if placed on a wall they turn into a door. Using the Personal Reality Key on one of these doors turns it back into a card.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 33,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Cosmic Warehouse",
      "Cost": 0,
      "Description": "Over the course of your adventures you're probably going to collect a metric duck-ton of stuff. Weapons, armor, technology, cars, big evil laser beams, everything and anything including several kitchen sinks. Why? Because you can. Now, normally you'd have trouble storing it all, and that's no fun, so here's your very own Cosmic Warehouse to give you a place to stick all your stuff. It is contained within its own reality that contains absolutely nothing else (guaranteed) and no matter where you go (unless blocked by a drawback or gauntlet) you'll always be able to access it. Before you do anything with it, it looks like a fairly dimly lit and very empty room. Your Warehouse forms the base of your Personal Reality, with any additions you buy or make expanding it through various means. Anything added to the Warehouse via CP purchase is guaranteed to work flawlessly with anything and everything else attached to the Warehouse. Anything added by the use of fiat-backed powers or abilities is likewise guaranteed to seamlessly integrate. This means that, although you can't just buy a house with cash in a jump and integrate it into your warehouse, you could enchant a closet already in your Warehouse with Harry Potter brand 'bigger on the inside' magic if you've been to a Harry Potter jump. Essentially, you'll get a complete set of manuals on how each thing you buy functions and listing how various techs and magics that you have already purchased can be integrated with what you have already. It won't make suggestions, but it will tell you how to accomplish something if you've already got the power and know-how needed to pull it off.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 34,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Costume Closet",
      "Cost": 50,
      "Description": "[Requires: Entertainment Room] What’s a performance without costumes? This adds a closet full of costumes, exactly what you need to perform your various acts or routines. The contents will adjust to the wearer and will be as comfortable as reasonable, but they’re not designed for everyday wear or actual fancy dress. They’re self-cleaning and self-repairing, but they cannot be removed from the Warehouse without the Ext ruder.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 35,
      "Prereq": true,
      "Prereq_Title": "Entertainment Room",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Detainment",
      "Cost": 300,
      "Description": "[Requires: Security System] Ensures that anybody without correct access authorization who attempts to break into your warehouse automatically gets detained in temporary cells, which are accessed through temporary doors in your Entrance Hall. The cells are not fiat-backed to hold everyone. If you’d have to exert yourself to fight someone, then the cells aren’t going to hold them for long, at least without any up grades. Detainment will attempt to work on anything that manifests anywhere in your warehouse without proper clearance... as well as anything that had proper clearance and is now clearly a threat. A Key holder cannot be detained.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 36,
      "Prereq": true,
      "Prereq_Title": "Security System",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Dig it",
      "Cost": 50,
      "Description": "[Requires: Realistic Ground Cover] You now have 40 meters of foundation material under your RGC. Why? Gardening? Graves? Whatever. It’s just rocks and dirt down there, but all buildings you buy in this supplement have perfectly decent foundations installed under them. If you bought the Underside, all that space is dig able too. You might even find some weird or cool stuff buried. Nothing amazing, but you’ll be a m used.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 37,
      "Prereq": true,
      "Prereq_Title": "Realistic Ground Cover",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Digital Database",
      "Cost": 100,
      "Description": "[Requires: (The Library Jumpxandria && Central Control)] This Library Upgrade automatically digitizes every text that enters your Personal Reality, even if it’s already in digital format, and does so safely (spells will contain the correct symbols but not power, memetic or conceptual texts will be r end e red harmless). The entire contents of your Library are now completely search able, indexed, and Intelligently cross-referenced, allowing far easier use and accessibility.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 38,
      "Prereq": true,
      "Prereq_Title": "(The Library Jumpxandria && Central Control)",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Digital Extranet",
      "Cost": 200,
      "Description": "This handy add-on connects your Personal Reality with the local Data Networks of the Universe you’re currently in... not only that, but it gets the kind of performance only really ever seen by ISPs at their hubs. If your current Reality of Residence does not have a Data Network, this will connect to the nearest equivalent.. yes, even if that is nothing more than a town gossip and a local library.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 39,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Discount Additional Space",
      "Cost": 100,
      "Description": "[Requires: Starting Space] Instead of the above, this only multiplies each dimension by a factor of 3. Two purchases of this count as one purchase of the above for those features that count Additional Space Purchases.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 40,
      "Prereq": true,
      "Prereq_Title": "Starting Space",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Downsizing",
      "Cost": 200,
      "Description": "[Requires: Housing Complex] Multiple Purchases Allowed. Each purchase of this reduces the number of Apartments per Building by ½ and the size they split to as well, obviously. Thus, one purchase means each Building maxes out at 16 units and splits into two 8s, two purchases means each maxes out at 8 units (pretty small buildings really), three purchases means each maxes out 4 units (more a townhouse style at that point), four purchases means each Building maxes out at 2 units (duplexes), and five purchases means every Apartment is now a freestanding House.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 41,
      "Prereq": true,
      "Prereq_Title": "Housing Complex",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Dynamic Waterworks",
      "Cost": 100,
      "Description": "This is a strange one, but say you have an infinite source of some liquid and you want it pumped from wherever you source it through your Personal Reality, this Pipes Pipes Pipes Upgrade is for you. The plumbing hookups for your Reality now support up to six additional in puts from sources you must personally supply, and run those feeds through your Reality. If you have Central Control, they can even be mixed in precise ratios at each distribution point. So, say you had an infinite supply of cocoa and an infinite supply of peppermint schnapps... you could set the system to dispense cocoa from all the brown faucets, peppermint schnapps from all the red and white faucets, and spiked hot chocolate toddies from the brown and red faucets... and could even tell it to make the mix in your office stronger than the mix in the staff break-room. While this can be combined with Water World to a degree, that degree is only to use the hose network to dispense a reasonably vast quantity of ‘unlimited liquid x’... say enough chocolate to make a small river... not to flood the planet... unless your source for that unlimited liquid specifies ‘absolutely unlimited’... generally speaking, if it’s for personal or even industrial use... it’s not good enough. Global usage at the very limit required for full Water World Integration. An additional 6 hook-ups costs 50 WP or 1 additional hookup can be had for 100 CP.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 42,
      "Prereq": true,
      "Prereq_Title": "Pipes Pipes Pipes",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Eldritch Fueling Station",
      "Cost": 150,
      "Description": "[Requires: Fueling Station] This up grades your fueling station so it can fuel any vehicle you have no matter how esoteric the fuel might be. Attempts to use the fuel it produces for other purposes may have terrible consequences.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 43,
      "Prereq": true,
      "Prereq_Title": "Fueling Station",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Entertainment Room",
      "Cost": 50,
      "Description": "Keeping yourself busy isn’t always easy, and sometimes you just want to relax and listen to some music or watch a movie. This is for you. A six-room complex is added to your Personal Reality. Each room is an almost perfect movie theatre, music room, video-gaming t heat re, sound stage, or miniature live theatre. There are 24 comfortable chairs in each (the exact level of luxury depends on your housing level). A popcorn and generic candy vendor and off-brand soda dispenser (self-service) are provided at the basic, but will upgrade to name-brands with any housing upgrade. If you have The Commons upgrade for your Housing Complex, every Commons gains its own pair of these rooms, with an additional room added every four purchases of Upscale or Luxury Apartments. Every Opulent Unit gains its own room. If you don’t have the Housing Complex, you can buy the Upscale, Luxury, and Opulent up grades (once each) to upgrade the Entertainment Room to that level.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 44,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Entrance Hall",
      "Cost": 0,
      "Description": "This is the room your Access Key opens a door to. It starts off as a 5 meter cube with blank white walls, floor, and ceiling, as some doors, one leading to the current Host Reality, the other into your Cosmic Warehouse, with additional doors leading to other extensions as these get added to your Personal Reality. Feel free to customize this Entrance Hall as you see fit. Additional Halls can, at your discretion, be linked only to certain keys or only to certain extensions. This allows you to have an entry hall just for skiing if you want.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 45,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Environmental Controls",
      "Cost": 200,
      "Description": "[Requires: Environmentally Neutral] Not only does this allow you to control the temperature inside your Personal Reality... it allows you to change the temperature, humidity, ambient noise, gravity, and airflow to any and all parts of your Personal Reality independently. Want a one meter cube of free zing cold nothingness surrounded on all sides by temperatures that would be fitting for soup? Go for it. This can change the gravity from 0.00001 gees all the way up to 8 gees, the temperature anywhere from -40 °C all the way up to 180 °C. Comes with a tablet that has all the system controls you’ll need and a big ol’ box of wireless thermostats. The direction of gravity can be easily manipulated in whole or part of your Reality. So if you want to build a Labyrinth style room with doors and stairs going every-which-way, feel free. This virtually eliminates dust build up (1,000th normal). If you’ve been to a setting with a special atmosphere (airborne manna or chi in f used air for instance) this can replicate that environmental effect.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 46,
      "Prereq": true,
      "Prereq_Title": "Environmentally Neutral",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Environmentally Neutral",
      "Cost": 0,
      "Description": "By default, the temperature in your Personal Reality is never too hot nor too cold, the air will always smell faintly musty but scent neutral, and the air will always be breathable… even if two different species with different atmospheric requirements are present in it at the same time… well, as long as both species are there with permission. This won't protect breathing invaders. Earth Standard Gravity will be maintained in all areas, and the air will be just humid enough.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 47,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Esoteric Collection",
      "Cost": 100,
      "Description": "[Requires: The Library Jumpxandria] This is function ally identical to Expanded Collection, but it is not limited to real-world subjects. To be eligible, a subject must be one that is widely known in any setting you have visited. This can include fiction, but only fiction from universes you visit.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 48,
      "Prereq": true,
      "Prereq_Title": "The Library Jumpxandria",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Eternal Eternalizer",
      "Cost": 200,
      "Description": "[Requires: Eternalizer] This upgrade means that nothing inside your Personal Reality ever ages unless you actively want it to. Thus, your wines and cheeses can age, but your books won’t. If you have Maintenance Systems, the Personal Reality will auto-detect the exact right degree of aging for anything within and never allow it to age past that unless you specifically instruct it to do so. Why? Because with the Eternalizer, you could leave a slice of bread out on the counter for a billion years and it wouldn’t go stale... stale bread is useful if you want to make good French toast. All non-authorized lifeforms can be automatically aged to dust, assuming they would normally die of old age, though this doesn’t work on anything more advanced than a baseline human.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 49,
      "Prereq": true,
      "Prereq_Title": "Eternalizer",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Eternalizer",
      "Cost": 200,
      "Description": "[Requires: Temporal Controls] This upgrade keeps anything you bring into your warehouse from decaying or aging unless it is a living organism more complex than a normal in sect. If combined with the Security System (yes, we know it’s free, but you might not have taken it for some reason), this will auto-detect any kind of pest species or life form and stop them from maturing at all. Thus no mold growth, no larval maturation, etc. You’ll still have to hunt down and kill any individual bugs or beasties, but they won’t reproduce.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 50,
      "Prereq": true,
      "Prereq_Title": "Temporal Controls",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Expanded Collection",
      "Cost": 150,
      "Description": "[Requires: The Library Jumpxandria] Multiple Purchases Allowed. This specializes your library in a specific way, adding books on specific topics, things that you would expect in specialized university libraries. Each purchase of this comes with 60,000 titles in the language of your choice (even if such works have never been published in that language). The more specific a topic you pick, the more specific these books will be. So picking Biology as a topic will get you books on zoology, botany, anatomy, genomics, microbiology, and ecology, while picking entomology as a topic will give you extremely detailed books about different types of in sects, their physiology, and so on. Choosing a specific culture multiplies the number of titles gained by the square root of the number of centuries that culture has existed. Extinct cultures do not generate this bonus. The subject must be one from the real world, but do remember that there are thousands and thousands of real-world books on the occult, so it’s not unlikely you can find what you like. Each expansion also comes with specialized journals, magazines, and other periodicals on the topics. This does not include fiction. For each purchase of this Upgrade, once per month, you can request a very specific sub-topic related to the core topic (e. g. architecture... of the Louvre, history... of trade on the Yangtze, quilt m a king in the 1880s, etc.). You’ll receive a dozen books on the subject... assuming a dozen such books exist in the real world and are reasonably available (not unique or exception ally rare).",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 51,
      "Prereq": true,
      "Prereq_Title": "The Library Jumpxandria",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Eye Spy",
      "Cost": 100,
      "Description": "Are you a peeping tom? Or are you simply hypervigilant? Well, you can now view (with any sense you have) anything happening in your Personal Reality, or anything that’s happened in the last day, PR Time. Key holders can establish blackout zones around themselves, blocking out your ability to view the room they’re in or an area 20 meters radius around them. You’ll be notified whenever they do so. With Jump Recording below, the one day limit is removed and you can view anything that has ever happened in your Personal Reality.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 52,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Fabricator",
      "Cost": 200,
      "Description": "[Requires: Recyclotron] Turns any raw materials harvested by the Recyclotron into anything you have a blueprint for. Adding a blueprint is as simple as tossing a sample of any item you know how to make into the Recyclotron. Anything made by the fabricator will be a perfect physical copy of what was dumped into it. This does not include any metaphysical proper ties and you’ll have to supply all required materials.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 53,
      "Prereq": true,
      "Prereq_Title": "Recyclotron",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Flex Happy, Flex Returns",
      "Cost": 100,
      "Description": "[Requires: Many Happy Returns] Instead of simply being able to take a Return after a Jump Ends (or waiting a decade if you’re no longer jumping), you can spend Credits (or Deci Credits or Centi Credits if you have access to them) as often as you like and can afford. Yes, you can use multiple Credits between jumps or decades in your home reality (original or adopted). But you can also use them in the middle of other jumps if you’re still jumping! Time is paused in the jump you’re currently experiencing while you detox or whatever. You cannot use this effect during Gauntlets, even if you have access to your Personal Reality during that Gauntlet.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 54,
      "Prereq": true,
      "Prereq_Title": "Many Happy Returns",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Fly a Kite",
      "Cost": 50,
      "Description": "[Requires: Sky Simulator] While this doesn’t add any usable height to your Personal Reality, it means that all the sky space is free for use for flying kites or hot air ballooning or just recreation ally flying around in. Comes with realistic clouds if you have Environmental Controls.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 55,
      "Prereq": true,
      "Prereq_Title": "Sky Simulator",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Force Wall",
      "Cost": 200,
      "Description": "[Requires: Security System] This adds a force-field to the entrances and exits to your Personal Reality. Nothing unauthorized can pass through these force-fields. The field is fully permeable to anything authorized. A Key holder’s Access cannot be blocked by these fields. Be aware, some enemies might conceivably be able to enter your Personal Reality without technically ‘passing through’ these force-fields. I don’t know, but don’t assume the Force Wall is utterly infallible. It is also potentially possible that you or your companions might bring something seemingly harmless into your Reality that turns out to be some kind of threat.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 56,
      "Prereq": true,
      "Prereq_Title": "Security System",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Free Portal",
      "Cost": 100,
      "Description": "[Requires: Playing With Portals] Removes the limitation on a portal having to be opened on a flat surface... or on any surface at all. It also allows you to open the portals to any part of your Personal Reality simply by picturing where you want the portal to open. Without the Control Rod, the portals must be opened within 2 meters of you.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 57,
      "Prereq": true,
      "Prereq_Title": "Playing With Portals",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Fueling Station",
      "Cost": 50,
      "Description": "[Requires: The Garage of the Gods] This provides all your vehicles with any standard mundane fuel they need to function. Do not attempt to use this to gain an unlimited supply of gasoline or diesel. Any fuel provided by this station that is removed from its vehicle will evaporate within 20 minutes. All fuel generated by this station is environment ally neutral, aside from the heat generated by burning it.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 58,
      "Prereq": true,
      "Prereq_Title": "The Garage of the Gods",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Getcha Berths Here, Boy O!",
      "Cost": 100,
      "Description": "[Requires: The Garage of the Gods] Multiple Purchases Allowed. Need more berths? This adds 8 additional parking berths to your garage, multiplied by 5 for every Starting Size Increase you purchased above.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 59,
      "Prereq": true,
      "Prereq_Title": "The Garage of the Gods",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Grand Dining Hall",
      "Cost": 100,
      "Description": "Would you like to show up Odin if he ever comes to visit? Now you can with your own personal Valhalla, an enormous feasting hall, one as large as the number of guests would need, with room left over for dancing and fighting and contests of prowess and might and little secluded niches for musicians or assignations... or ass assinations. Whatever floats your party-goers’ boats really. The décor starts off pretty rustic, yes, mostly giant wooden beams and the bones of giants, but as you gain Followers and Companions... and achieve great deeds, so too does your Grand Dining Hall’s glory increase. Indeed, even the deeds of your friends will be reflected in its walls and decorations. This doesn’t just extend to combat. All glorious victories are celebrated in your hall. A more violent crew will have a more rough and ready hall, a militant crew will have one organized and sober, a group of madcap wanderers will have a veritable circus, and a cadre of saints and diplomats could have a heavenly scene. The hall absorbs all food and drink purchases you have made and displays them on platters and side boards, always perfectly fresh, always at the ideal temperature.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 60,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Guardian’s Greenhouse",
      "Cost": 100,
      "Description": "Would you like a greenhouse for your Personal Reality? One in which you could grow your own vegetables and fruits? I hear that strawberries are especially popular this season. This is for you. This greenhouse is set up for geoponics/terraponics, hydroponics, or aeroponics and is contained in a separate structure that has a footprint exactly half your Starting Size in all dimensions. Any increase in size to your main space multiplies your Green house’s space by a factor of 5. All plants/fungi grown in your Greenhouse are guaranteed to be either vibrantly tasty and nutritious (for those you eat) or peak effective (for herbs, spices, teas, smokables, and reagents). Yes herbs are eaten too, but they’re more about flavor than nutrition. The Greenhouse comes with a Soil Sampler/Analyzer, which can analyze a plant or seed to determine what conditions it needs to produce optimal results and produce soil, clay, mulch, rock, atmosphere, or hydro-solutions to match. It can also analyze soil samples you give it and recreate them. If you have Environmental Controls, your Greenhouse can perfectly recreate a plant’s ideal climate. If you have Servants or Robots, they can do the harvesting and distribution to various chillers. Purchase of this Greenhouse provides all kitchens in your Personal Reality with a custom Guardian Chiller. Fruits, Vegetables, Spices, Herbs, Mushrooms, and similar produce stored in a Guardian Chiller are guaranteed not to lose their flavor over time and to remain at the peak of ripeness as long as that’s where they were harvested. If you have the Housing Complex Commons, each Building gains its own community garden with 25 square meters per resident. This area is trip led with the purchase of the Quadrangle. If untended, each plot will produce a mix of broccoli or cauliflower, sugar snap peas, green and red peppers, green beans, kale or mustard greens, beats or chard, radishes, carrots, summer squash or zucchini, celery, iceberg or romaine lettuce, yellow or green or red cabbage, white or red onions, scallions, cucumbers, water or honeydew melons, waxy or russet potatoes, cherry or roma tomatoes, fennel, chives, mint, sage, rosemary, thyme, basil, oregano, cassava, and yams/sweet potatoes.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 61,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Gym-Classy-Um",
      "Cost": 200,
      "Description": "[Requires: Gym-Nasty-Ium] Know how the Arena in Gym-Nasty-Um mentions only Physical Potential? Well now it can be used to train anyone to any Mental or Spiritual Potential they might have as well. Yes, that’s all you get for your 200 WP. Don’t like it? Don’t buy it. Okay okay... All energy expended during a match is now restored once you leave the fighting area, but only once every 24 hours. You’re still going to feel pretty sore and d rained for at least a little while, unless you have a perk for that.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 62,
      "Prereq": true,
      "Prereq_Title": "Gym-Nasty-Ium",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Gym-Nasty-Ium",
      "Cost": 300,
      "Description": "[Requires: Gym-Nice-Ium] This gives your Gymnasium a full-on Arena, and removes the limiter on what can be trained and now it can be used to train anyone to any physical potential they might have. The sparring pit is now outfitted with duplo droids, sparring partners that can duplicate the fighting strength and style of anyone you’ve ever fought... or even combine enemies and styles to attempt to throw you curves. Every fight you’ve ever been in and every fight you’re in from now on can be replayed by the Arena. Fights in the Arena are never fatal, like Pokemon Battles, they only result in KOs, no matter how ludicrously OP the strikes are. Additionally, attacks that can be used a limited number of times (be that per X amount of time, per jump, or ever), even ones that would result in the death of the user, can be safely used here without counting against that limit, thus allowing practicing with techniques that normally couldn’t be practiced with. Energy (stamina, man a, spell points, spell slots, etc.) expended here is still expended however. If you use the Arena Supplement, you may incorporate it with this Arena for an additional 100 WP.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 63,
      "Prereq": true,
      "Prereq_Title": "Gym-Nice-Ium",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Gym-Nice-Ium",
      "Cost": 100,
      "Description": "This provides your Personal Reality with a large open training room for physical exercise. A Gymnasium in other words. It comes with exercise equipment that can be used to train almost anyone dedicated enough to the limits of their potential fitness. It can be easily converted into a sparring pit. If you have Robots, this includes extremely durable sparring automatons to learn from in your pit. Anybody u sing the Gym will find that training physical abilities is slightly less fatiguing than it otherwise would be. If you have the Medical Bay, anyone accident ally injured here will be instantly transported to the Medical Bay for treatment. Damage done in sparring matches does not trigger that effect until the fight ends, either by tap out, a combatant leaving the fight area, or a KO. If a blow would be instantly fatal, it is canceled a split-second before it lands.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 64,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Hallowed Earth",
      "Cost": 400,
      "Description": "Every inch of your Personal Reality is sanctified. By who? Well... you, I guess. All those within (besides you obviously) are subject to a constant minor blessing that persists for up to a day after leaving that makes them a little luckier and healthier. In D&D terms, a general +1 Morale bonus. Those who worship you as divine may show up here when they die or see visions of you in this, your place of power... though these visions may be merely metaphors for what lies within if they lack the mental or cultural framework to understand. With Linked Portals you may appear anywhere inside your Personal Reality without having to walk there and with Eye Spy you are aware of everything that happens in this Reality. With Central Control, you are constantly aware of the contents of the PR.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 65,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "High Courts and Low",
      "Cost": 0,
      "Description": "[Requires: The Semi-Secret Garden] While the Park is great, not all varieties of sports can be freely played on open grass. Soccer and football might be possible with some personalized rules or some chalk, but games like tennis and basketball are probably right out. With this Garden upgrade you’ll find a couple of tennis courts, handball courts, and a basketball court have been added for you and your companions to enjoy playing all sorts of games. If you need a pitch or field for some sport, a section of your garden will be prepared for it, though it might take a couple of hours depending on how extreme the sport’s requirements are. If you have the Quadrangle, each of those parks gain this feature.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 66,
      "Prereq": true,
      "Prereq_Title": "The Semi-Secret Garden",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "High Security Inter-Reality Connecting Doors",
      "Cost": 200,
      "Description": "Exactly like Inter-Reality Connecting Doors, except they can be locked and Force Field protected. Breaking the connection is free, but your HSIRCD cannot be redeployed for 1 full jump.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 67,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Hollow Earth",
      "Cost": 100,
      "Description": "If you want your Warehouse walls to look like a cave or the inside of an O’Neill Cylinder or a weird Mobius Room, this is the option for you. It’s your choice if this means your walls actually loop around to the ceiling or not, but if they do, passing the mid line means you fall up instead of down and there’s an area of null-gravity at the center/axis of rotation/whatever.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 68,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Housing Complex",
      "Cost": 100,
      "Description": "With this option you gain enough housing for every sapient you have in your retinue. Each adult or juvenile sapient (need not be a sophont) among those beings you allow to live permanently (or semi-permanently) in your Personality reality gets their own personal bedroom... Although technically they can do whatever they like with their own room, as odds are good a great many of your followers might be sleeping together at any given time. Personal rooms can be merged if all the occupants so desire. Each personal room de faults to 5 meters by 4 meters by 3 meters. The standard unit of this Complex is the “Apartment”. By de fault, each “Apartment” contains four “bedrooms” when created, a kitchen and dining room, two full bath rooms with combination shower/bathtubs, two general purpose shared rooms (offices, living rooms, game rooms), a few small closets, and a pantry. Each Apartment must have a kitchen. One kitchen per six people (except for newly budded Apartments). That’s the rule. No more Apartments than the total number of kitchens. An Apartment may, of course, have more than one kitchen. Other Extensions can fuse with the Complex if you want. Each “Apartment” is designed for up to six people, but each new “Apartment” starts off as a bud of a previous unit until that unit has more than 9 residents, at which point it can split off into a separate unit, but that need not happen. Thirty-two Apartments make a single standard “Building” at which point the Building divides into two with sixteen “Apartments” each and the process begins again. The exact layout of each Apartment is subject to change by the residents, and how the various Apartments in a Building is subject to the residents of that Building’s approval, but in general, the de fault is 4 Apartments per floor. Elevators are included for free. The arrangement of the Buildings themselves relative to each other can be changed by you or any administrator you appoint. Personal Rooms move with their owners if they change Apartments. This housing is not luxurious by any means, but the individual rooms tailor themselves to the general likes of their owner and come with basic but not quality furniture. non-bedrooms are on the small side but large enough to function. Floors are basic linoleum and walls are basic low grade paint. Appliances and fixtures are pretty bare bones and the walls are little more than plywood and wood frame. The bedrooms don’t have closets. The Housing Complex only provides rooms for Companions, Permanent Followers, Pets, and the Offspring of those previous groups. You, the Jumper, of course get a room if you want one.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 69,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Improved Regulation",
      "Cost": 400,
      "Description": "[Requires: Environmental Controls] Unhappy with the limits of Environmental Controls? This gives you a much greater range. How much greater? You can control the ambient noise level to generate sounds anywhere between -10 decibels and 160 decibels. Temperature-wise, you can change it from absolute zero to 15,000 degrees. gravity-wise, you can completely negate gravity or ramp it up to what is common on the surface of a neutron star. Humidity? Anywhere from 0% to 150%. That’s not a very dense fog, that’s active rainfall... though this last requires Pipes Pipes Pipes or a very large amount of water in your Personal Reality. As for airflow, you can have F-5 scale winds if you really want them. Hell, go nuts, have the kind of winds only seen in gas giants, the kinds that make an F-5 tornado seem placid. Think Coriolis Winds in excess of 800 Kilometers an hour. This eliminates atmospheric dust.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 70,
      "Prereq": true,
      "Prereq_Title": "Environmental Controls",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Infinite Office Worx",
      "Cost": 50,
      "Description": "Multiple Purchases Allowed. A personal office specifically for you, so that you can perform your white-collar paper-shuffling in relative privacy. A decent-sized office, it comes with all the basic supplies and equipment, such as notepads, paper clips, ink pens, filing cabinets and a desk. If you purchased Computer Hub it comes equipped with computer equipment as well. If you have VOWP it has a phone with an outside line that always direct-dials whoever you want to reach in your current Host Reality... even if they don’t have a phone... you may not use this ability to locate them or translocate to their location or tag them with any power or ability or technology. You can ask them where they are, but they don’t have to tell you. This office has the effect of slightly boosting your focus, reading speed, reading comprehension, and retention rate, but only as long as you’re alone in it. Alternatively, it can be set up as a cubicle farm with 20 individual cubicles.. but honestly... Why would you? If you do, each cubicle gets a potted plant, an executive desk toy involving magnets or chrome balls, and a Japanese lucky cat statue sized to fit on a desk. All are completely mundane. Each additional purchase adds the next Fibonacci number of offices (or 20 cubicles per office). Thus, the second purchase will get you a second office, while the third purchase will get you 2 more offices, and the fourth will get you 3 offices and the fifth will get you 5 offices... please tell me you aren’t seriously going to waste WP on OFFICE SPACE? What part of ‘Keep this entertaining’ escaped you, CPA Man!? No matter how many offices this generates, any Key holder can always find a specific office simply by concentrating for a couple seconds.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 71,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Inter-Reality Connecting Doors",
      "Cost": 50,
      "Description": "Exactly like a standard Connecting Door pair, except it can link one part of your Personal Reality and anywhere else you install it... You must be physically at the location you desire to install it and once installed the Door cannot be removed by anyone or anything lacking a Personal Reality Key. As long as these doors exist, they require no key to open and cannot be locked and these doors are not protected by the Force Field Utility. If you connect an external reality to your Personal Reality through a pair of these doors, that reality is not frozen in time, but rather progresses on your Personal Reality’s internal Clock, even after you leave it, even if the door is currently closed. It also means that those on the other side can open the door without your permission, so be careful where you put it. Breaking the Connection causes the Connection to decay over the course of that jump at the cost of 100 from that jump. You get your door back at the end of the jump... if you haven’t changed your mind. If you do... no CP refund. Sorry.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 72,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Items and Equipment Cleaning Supplies",
      "Cost": 0,
      "Description": "Have an infinite supply of any cleaning supplies you might need for cleaning your Personal Reality. By de fault, this supply is placed into a specific closet near the Entry Hall to your Personal Reality, but the closet can be moved anywhere you like inside the Personal Reality... and can, in fact, be summoned by anyone allowed to reside in your Personal Reality by any Key Holder. These supplies have no actual chemical proper ties and you cannot use this to get an endless supply of b rooms or bleach. Completely safe for all complex lifeforms. Very not safe for viruses, bacteria, amoeba, or household pests.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 73,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "It’s a Small Multiverse",
      "Cost": 100,
      "Description": "What? You’ve already been to “Batman the Dark Knight” Jump and recruited Batman as your companion, and are now going to “Batman the Animated Series” and want to import your Batman into the new jump’s native Batman, combining them into one person? You want the same option for any other comparable instances? Alright then. With purchase of this you can now import your Companions as their native counter parts/analogues for free, but they will not receive any CP to spend on their purchases unless you also pay for their import via that jump’s native Companion Import option. This is native counterpart/analogue import is not automatic or required, it simply becomes an option and you can authorize it or not on a per individual basis.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 74,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "I’m Game Room",
      "Cost": 100,
      "Description": "So much free time, so little to do. This room is the answer to that. Not only is it equipped with 6 networked PCs customized for gaming circa the year you came from, it has up to 12 real-world gaming consoles and any gaming network required to connect them. The furniture matches your general housing level but will always be at least comfy bean bags. In addition to the PCs and consoles, you’ll also get a dozen real-world arcade cabinets (up to four of the same machine may be counted as a single machine for multiplayer games), a pool table, a billiards table, a two-lane bowling alley, a darts set up, and up to six other game-specific tables, including tabletop board games and RPGs. The room comes with a mini-fridge and microwave if you have Powa. And a room for games wouldn’t be very much use without games, so you may select 250 games from the real world to have up to 6 copies each of, and you gain 6 copies of any one new game from the real world or any setting you’ve been to (all DLC or expansions included) every month. Free of charge. No magical or other-wise powered games included. If you also have the Entertainment Room the two can be combined to turn the rooms into personal gaming rooms using the Game Room equipment. If you have the Housing Complex, every Basic Apartment gets its own networked PC and 2 gaming consoles. Choice Apartments get two PCs and every bedroom gets its own console. Luxury and Opulent Apartments get one PC and two consoles per resident. If you have the Commons Upgrade for the Housing Complex, every Commons gets the arcade cabinets, the pool table, the billiards table, the bowling alley (at 4 lane s), the dartboard, the gaming tables, and their own set of the gaming collection. None of the PC s/consoles can connect to the outside reality without the Extra net option, but they are all linked to an internal network that has zero latency, never gets throttled or bottle necked, and never lags. If you have Central Control, it also automatically flags all cheaters and can filter inappropriate material for minors and others with delicate sensibilities.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 75,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Jump Recording",
      "Cost": 200,
      "Description": "You’re now the star of your very own reality TV program! In visible, intangible all-sense cameras follow you everywhere and record everything that you and your companions do. These recordings are then edited for maximum view ability and compiled and cross indexed. What happens next depends on if you bought the limitation ‘Big Benefactor’. If you did, you get this for free. If you didn’t, you have to pay for it. Either way, you get the copies of the footage, both raw and edited. If you have Big Benefactor... you also get the edited footage of the show that they made for it, audience feedback figures, and all the rest. (See Big Benefactor for details.) Does not come with any equipment sui table for watching the footage.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 76,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Jump Topic",
      "Cost": 50,
      "Description": "[Requires: The Titan’s Mall] After every jump concludes, your mall gains a general store specific to that jump’s reality that carries commonly available consumer goods and pre-packed food items indicative of that reality’s culture and cuisine. Think convenience store bentos or carry out Chinese food. Also carries spare parts for mundane equipment from that reality. If you’ve used More for More to upgrade the general level of your shops, the Jump Topics will also be improved, carrying higher end goods and food.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 77,
      "Prereq": true,
      "Prereq_Title": "The Titan’s Mall",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Key Link",
      "Cost": 50,
      "Description": "[Requires: Access Key] Multiple Purchases Allowed. With this, you can now close the door while you are in the Personal Reality and use your key in a special podium in the entryway to link your Personal Reality Door to any door in your current Host Reality that you’ve previously used your Access Key on. If you have extra keys, any door opened by any of them can be accessed. You may also use a recall function to bring up a list of all the doors that have been accessed by any key, thus allowing you to follow a Companion should you so desire. Only your main Entry Hall has this podium. To install a second Key Link Podium you’ll have to buy this a second time, though each subsequent purchase comes with two more podiums.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 78,
      "Prereq": true,
      "Prereq_Title": "Access Key",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Kit and Kaboodle",
      "Cost": 0,
      "Description": "[Requires: Entertainment Room] There’s not much purpose in having a sound-stage if you don’t have recording equipment and instruments. While not the best, this Entertainment Room Upgrade provides you with professional-grade musical instruments of any kind found on Earth, and a professional mixing board and easy to follow instructions on how to make the best use of it. The instruments from this can’t be removed from the Warehouse without the Ext ruder.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 79,
      "Prereq": true,
      "Prereq_Title": "Entertainment Room",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Let’s Have Fun",
      "Cost": 50,
      "Description": "[Requires: The Big Pool] This adds water falls, jumping decks, and other similar stuff for your pool complex, including a wave pool and a dozen different water slides of the kind you’d find at the best water parks. This includes small coves for more private types of fun, or mass aging pools for relaxing water mass ages.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 80,
      "Prereq": true,
      "Prereq_Title": "The Big Pool",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Library Services",
      "Cost": 100,
      "Description": "[Requires: The Library Jumpxandria] Any written text that you add to your library, assuming you or any member of your team possesses the ability to translate it, will gain an appendix that includes all idiomatic word usage, cultural or historical references, and even scholarly explanations of the author’s background and possible inspirations. All such notes will be written from an academic, in setting standpoint, as if written by a learned scholar writing from no more than a single century in the future from the time the original work was created. Additionally, if you request a specific book translated into a different language, it will be produced within 24 hours, and the translation will be written by an expert native speaker of both languages. Cover art for the new version will be similarly translated. You or a member of your team must know both languages to a high fluent level for this translation service to work properly.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 81,
      "Prereq": true,
      "Prereq_Title": "The Library Jumpxandria",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Lofty Loft",
      "Cost": 50,
      "Description": "[Requires: The Loft] Is it depressing having your home surrounded by storage space? You gain an area the same size as your starting space that is reserved entirely for housing and luxury facilities, such as pools and sports fields. It is situated either next to your Cosmic Warehouse or above your Cosmic Warehouse. Separate purchases of Additional Space applied to it instead of Cosmic Warehouse can be used to expand it. You’ll have to decide if Warehouse mods from jumps are applied to the Lofty Loft or the Cosmic Warehouse.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 82,
      "Prereq": true,
      "Prereq_Title": "The Loft",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Luxury Apartments",
      "Cost": 200,
      "Description": "[Requires: Choice Apartments] Multiple Purchases Allowed. This does everything that Choice Apartments does and does it better; high end luxury rugs, lush car pets, parquet wood floors, wood paneled walls, high end furniture, rooms are twice as large as the base, and the cut off for additional kitchens is lowered to every four persons. Appliances and fixtures are very nice and stylish now and the walls are quite soundproof. Closets are now a respectable size. Bedrooms get their own bath rooms. Master Bedrooms are now a personal suite (sitting room, bedroom, two walk-in closets each, bathroom with separate whirlpool bath and shower). Where each purchase of Choice Apartments improved one third of all Base units, Luxury Apartments improves a tenth of all Choice Apartments units.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 83,
      "Prereq": true,
      "Prereq_Title": "Choice Apartments",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Macro Happy, Micro Returns",
      "Cost": 100,
      "Description": "[Requires: Many Happy Returns] You may now parse your Return Credits into Deci Credits. Each Deci Credit is a 1 year return. You can spend up to 10 Deci Credits between jumps (while Jumping), or per 20 year period if you are no longer Jumping. If you also have “A Month’s Return”, you may, if you really feel like all the bookkeeping, divide your Credits into Centi Credits of ~36 days each. Yes, doing this is going to cost you about 5 days total. Cope with it. You can spend up to 100 Centi Credits between jumps while Jumping or per 20 year period if you’ve retired.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 84,
      "Prereq": true,
      "Prereq_Title": "Many Happy Returns",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Maintenance Systems",
      "Cost": 100,
      "Description": "[Requires: Your Robots] This up grades your robots so that instead of just sorting and fetching they now automatically upgrade with all tech production and repair skills you gain and now provide basic cleaning and maintenance services for anything in your Personal Reality that you know how to fix or repair. They are going to be practically in visible unless you look for them.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 85,
      "Prereq": true,
      "Prereq_Title": "Your Robots",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Mall of All",
      "Cost": 100,
      "Description": "[Requires: More for More] This More for More Upgrade requires you to have bought More for More enough times to have 65 Shops in your Mall... and doubles the number of shops. This can be bought as many times as you like, and each time it adds twenty restaurants to your mall. There will be 10 common eateries (fast food, cookies, ice cream), 5 cafes, 3 mid-scale, and 2 upscale. Nothing that would get a Michelin Star, but something on the order of an expensive chain steakhouse or fancy French restaurant.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 86,
      "Prereq": true,
      "Prereq_Title": "More for More",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Many Happy Returns",
      "Cost": 200,
      "Description": "You may spend ten more years in a world you have visited before. After every 5th completed jump (or once every 10 years if you ever choose to stay or go home or spark out) you will earn a Return Credit. You may return to a world only after you have spent a jump away from that world, or 10 years if you ever choose to stay or go home. You may not use two or more Return Credits in a row to return to the same setting back to back, even if you have visited two different worlds in the same setting. When you return to a world, you will be returned to the very moment you left from if at all possible. Companions can, with your permission, use your Credits without you. This does advance the world they visit, but they can spend their Return while you’re in another jump. They will be gone for 10 years. You can only use one credit personally every Jump (or every decade if you’re no longer Jumping).",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 87,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Meditation Corners",
      "Cost": 50,
      "Description": "[Requires: The Semi-Secret Garden] This Garden Upgrade adds several hidden corners and alcoves that are perfect for meditation, being calm and relaxing. You’re guaranteed never to be disturbed unless it’s an actual emergency while meditating in one of these spots and time spent meditating is quadrupled.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 88,
      "Prereq": true,
      "Prereq_Title": "The Semi-Secret Garden",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "More for More",
      "Cost": 50,
      "Description": "[Requires: The Titan’s Mall] This Mall Upgrade up grades the existing shops from low-end common shops to upscale shops or from upscale to high-end shops. Think of it as being the difference between a mall in a working-class neighborhood and a mall in a white-collar neighborhood and a mall in a highly affluent neighborhood. Alternatively, if you want more shops, a single purchase of this adds 5 shops of your current level, 10 shops of one level lower, or 15 shops of two levels lower... The level below low-end is Cheap Junk Kiosk. You don’t want to know what the level below that is. Think weirdo in a trench coat.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 89,
      "Prereq": true,
      "Prereq_Title": "The Titan’s Mall",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "More Happy, More Returns",
      "Cost": 50,
      "Description": "[Requires: Many Happy Returns] Multiple Purchases Allowed. You may reduce the frequency of Return Credits earned. Each time you purchase this, it reduces the number of jumps/decades that need to pass by one. So the first purchase cuts it to 4, then 3, then 2, then 1. Each purchase beyond that increases the number of Credits per jump by +0.5. You still cannot use more than one credit personally every jump/decade.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 90,
      "Prereq": true,
      "Prereq_Title": "Many Happy Returns",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Movie and TV Series Collection",
      "Cost": 50,
      "Description": "Function ally identical to the Music Collection, but instead containing 15,000 hours of recorded passive visual media, all in a format your systems can play. All are available in their original languages, with sub titles that are below the bottom of the image and high visibility, with commentary explaining any cultural or production notes, with creator and actor commentary where possible, and with perfectly done dubbing into a language you speak like a native... or rather all languages you speak like a native... and this dubbing sounds exactly like the original actors. Every month you’ll receive 12 hours of new media.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 91,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Music Collection",
      "Cost": 0,
      "Description": "Multiple Purchases Allowed. You receive a collection of 500 albums (EPS or LPS) based on personalized criteria such as genre, artists, or themes (big band, love songs, acapella, etc.). Line r-notes, sheet music, and creator commentary/explanations are provided, as well as live performances, remixes, and covers. Total guaranteed run time not to be less than 2,000 hours. Every month you’ll get a new album. This can be purchased multiple times and only music from previous Host Realities is available. If you find that, upon listening to an album for the first time that you do not like it, it will be replaced... but since perfect memory perks are a dime a dozen, as king for a Replacement will result in a mental block being placed over the music. You’ll still be able to remember you heard that album and didn’t enjoy it, but not the actual music. This block is fiat-backed until you hear the album again someplace else or gain your spark.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 92,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "My Family",
      "Cost": 100,
      "Description": "You want your mother to be your mother in all of your Jumps? Same for your father being your father in all Jumps? Same for your other relatives? With this option it is now possible, you can freely import them as natives corresponding to that role for you, but they will not receive any CP to spend on their purchases unless you also pay for their import via a specific Companion Import option. This doesn’t make your family into traditional companions, merely guarantees that your family in-jump will be comprised of members of your selected imported family. This can be your family from your Original Reality (if you have means of bringing them along)... or your family from one of the Jumps... or mix and match. This can be toggled off if you don’t want them imported into a jump, and they do not have to actually be your Companions, but can always be turned into such if you decide so. Doing so will not alter their ability to family import. Adoptive relatives or relatives by marriage can be part of Your Family, although if you want to make them blood relations unless you pay for such change via actual Companion import. Furthermore, for them to count for import with this there has to be at least legal precedent to your relationship. Keep in mind that you can only use this for importing relatives that can logic ally be explained to exist based on visiting reality and your own origin, meaning that you can’t use this while drop-in, or that you can’t import somebody as your spouse if underage, or that you can’t import somebody as your children if the age difference between you isn’t large enough.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 93,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "My Harem",
      "Cost": 300,
      "Description": "[Requires: Seraglio-A-Gogo] This option allows you to combine any or all of your lovers and spouses into one or more companion slots, although once you’ve added a companion to a block there is no going back and separating them once again. Fortunately for you this doesn’t mean you can’t keep adding additional people to a slot, in case your harem continues to grow. Additionally, you may combine your various children into companion blocks as well. This means that companions within the same block get imported as a group while taking only one companion slot. It does not mean they get combined into one individual in any way.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 94,
      "Prereq": true,
      "Prereq_Title": "Seraglio-A-Gogo",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "My School",
      "Cost": 50,
      "Description": "If you’re doing a Jump during which you will spend the majority of your time in school, either as a student or as a teacher, then you may import as many of your companions as students and teachers at said school as you want. Or at other schools, if canon offers more than one of them. Students imported that way receive school-appropriate origin, but do not receive any additional CP to spend on their purchases unless you also pay for their import via that jump’s native Companion Import option. This option cannot be used to make Jump-specific Student or Teacher origins or imports free.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 95,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Natural Lighting",
      "Cost": 50,
      "Description": "[Requires: Neutral Lighting] Completely natural lighting that looks and feels and functions as good as the real thing (sun, moon, or starlight). Comes with sectional dimmer switches and can be source less or from any lamp like object you bring into the Personal Reality. Purchasing this up grades all sources of lighting you bring in, even things like TVs and Computer Monitors to be perfectly safe and naturally adjusting for minimal eye-strain. This replaces Neutral Lighting and does not require any power source.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 96,
      "Prereq": true,
      "Prereq_Title": "Neutral Lighting",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Neutral Lighting",
      "Cost": 0,
      "Description": "These lights are nothing special, It's a color-neutral, source-neutral ambient lighting system. It's not really that bright… think early twilight gloom, but if you want better, install it.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 97,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Non-Euclidean",
      "Cost": 200,
      "Description": "[Requires: Semi-Euclidean] This takes Semi-Euclidean and ramps it up to Cthulhu in Ryleigh levels. All the protections granted by Semi-Euclidean are removed and the space inside your PR is now one freaky weird place where lines aren’t straight and distance and scale are all out of whack. Expect normal people to need counseling after even glim p sing the inside of your PR. You and your fiat-backed companions, as natives, are somewhat immune to this effect... or at least highly resistant.. Full immunity costs extra. Those who aren’t fiat-backed count as ‘normal people’ though some ‘normals’ are able to deal with Sanity Attacks a lot more than others.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 98,
      "Prereq": true,
      "Prereq_Title": "Semi-Euclidean",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "One Art Please",
      "Cost": 50,
      "Description": "Multiple Purchases Allowed. Is there some work of art you just adore, but (say it’s a national treasure or something) you just can’t quite justify stealing it? This is for you. You can have a completely authentic copy of any “mundane” piece of “real world” art as long as it’s no larger than Mt. Rushmore. You still have to have room for it.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 99,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Opulent Apartments",
      "Cost": 400,
      "Description": "[Requires: Luxury Apartments] Multiple Purchases Allowed. This does everything that Luxury does and does it so much better. Rooms are frankly too big, fixtures and furniture are all unique hand crafted pieces, the walls have murals, the floor mosaics... everything isn’t just top of the line, it passed that miles back. High Ceilings, beautiful fengshui, custom décor for each room... huge closets. Additional kitchens generate every three persons. All Bedrooms are now Master Bedroom suites and come with ensuite sauna, day spa, and personal office with reading nook. Each purchase of Opulent Apartments up grades one tenth of all Luxury Apartments.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 100,
      "Prereq": true,
      "Prereq_Title": "Luxury Apartments",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Parkland Paradise",
      "Cost": 50,
      "Description": "[Requires: The Semi-Secret Garden] This Garden Upgrade turns it into a park, with paths through it that are perfect for running and skating, and grassy areas ideal for throwing around some frisbee. Maybe you could hang a hammock among these trees? Up grades the size to rival Central Park in New York (~900 acres).",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 101,
      "Prereq": true,
      "Prereq_Title": "The Semi-Secret Garden",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Partition Plan",
      "Cost": 100,
      "Description": "[Requires: Force Wall] You can now set up internal force-fields throughout your Personal Reality. If you have Central Control, they can even be customized with different levels of security. Be aware, a Key holder’s access cannot be blocked by these fields.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 102,
      "Prereq": true,
      "Prereq_Title": "Force Wall",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Personal Body Mod Pods",
      "Cost": 100,
      "Description": "Ever wanted to run a Companion or friend through the Body Mod? Now you can. Have fun. This pod is infinitely reusable as long as each person only uses it once. People using this get access to the same Body Mod Supplement as you used. You can’t use this to run yourself through Body Mod again. Anything that lacks a humanoid form can be given one by this machine. Running someone through a pod takes anywhere from one hour to one day, depending on the degree of changes.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 103,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 50,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Personal Mini-Realty",
      "Cost": 500,
      "Description": "If the purchase of Personal Realty feels too much to start with, then you can instead purchase this and instead gain only a copy of your home solar system (out to the Oort Cloud). Other limits remain, so it does not come with any intelligent life or “man-made” structures. You can upgrade to the full Personal Realty at any point in the future you wish so by simply paying 2700 WP for it (note the 200 WP financing fee). Personal Mini-Realty will integrate with it seamlessly, without any issues or dis advantages to you, meaning that you do not need to worry about changes you make to it in the meantime.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 104,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Personal Reality",
      "Cost": 3000,
      "Description": "Multiple Purchases Allowed. Your Personal Reality is now a copy of your home galaxy minus any intelligent life or “man-made” structures. Your other purchases are now a part of a massive space station exactly 15,000 Light Years above the galactic plane (or far enough from the rest of your reality that it won’t affect the gravity of the celestial objects in a negative manner) or placed on Earth in the location of your choice. If you already own any planets or solar systems then they get seamlessly added to this without any issues. This purchase can be useful for when you want to kidnap an entire civilization. Additional purchases of this can provide you with duplicates of any galaxies in which you lived through previous jumps, one galaxy per purchase, though limitations remain, so these purchases do not come with any intelligent life or “man-made” structures.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 105,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Pilot Simulator",
      "Cost": 50,
      "Description": "This adds a high tech simulator to your Personal Reality that perfectly replicates the experience of driving, piloting, or otherwise operating any vehicle that exists in your Original Reality or any Host Reality you’ve ever visited. Up to 20 people can use the same simulator for larger vehicles and there are 12 total simulators that can be linked together to make much larger simulations or team practices. Best of all, this allows you and your companions to do any required testing for various driving and piloting licenses. Licenses given with this are accepted in all jumps as long as you’d meet that local e’s basic competence level. (For instance, it’s much much harder to get a Finnish Driver’s License than a French one.)",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 106,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Pipes Pipes Pipes",
      "Cost": 100,
      "Description": "Purchasing this provides your Warehouse with enough plumbing fixtures to turn the entire volume of your Personal Reality into one massive pool... or anything below that. This provides clean running water with any reasonably common additives you like (chlorine, glacial milk, fluoride), but does not provide a limitless supply, nor does it heat the water. By de fault, the amount of water this system can produce per day is 1 billion liters or one megaton of water or a block of water 100 meters on a side, and the de fault temperature of this water is 25 degrees Celsius. It can support any civilian infrastructure on the same scale as Mexico City or Tokyo. Comes only with the basic hookups. You’ll need a plumber to do the actual piping. We hear Mario’s very good. Bath rooms not included. Purchasing this supplies all facilities inside your Personal Reality with water feeds, and if you’ve Got the Powa, it will supply hot and cold running water as well. These pipes include sewage and storm drain systems, vanishing waste as effectively as they create water. Anything that is not biological waste, loose grime, or liquid waste will be shunted into a special processing venue where you’ll have to dis pose of it (such as toys, trash, large trees, etc.). This venue will be somewhere discreet in your reality behind a door labeled “Authorized Pipes Personnel Only”. The stuff will be cleaned of biological contaminants for you. The entire Pipe system is self-cleaning and self-maintaining, guaranteed free of vermin and bad odors.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 107,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Playing With Portals",
      "Cost": 300,
      "Description": "Removes the need for use of Access Key, instead allowing you to open a rectangular or circular portal that leads into your Personal Reality on any flat surface big enough to encompass the portal. You can open the portal on any surface you are in contact with or that your vehicle is in contact with... or that your vehicle will be in contact with in less than 5 seconds and within 100 meters if you don’t open the portal. The portal can be any size between 1 square meter and 80 square meters. The portal opens to the same place in your Personal Reality as the Door does and you may still use your Access Key if you want to open a door larger or smaller than the limits of the Portal. Any Companion with a copy of the key may also open such a portal. These portals open at their lo west size instantly and expand to their maximum size over 10 seconds. These portals cannot be closed while you are inside your Personal Reality. Portals will slowly close over a period of 3 minutes if you leave them open and move more than 10 meters from one without closing it yourself, as long as you are outside your Personal Reality. This closure effect can be disabled, but you can’t open a portal if another is open.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 108,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Pod Override Exclusion",
      "Cost": 300,
      "Description": "WARNING. TAKING THIS NEGATES COMPANION CLARIFICATIONS BELOW. So, you don’t want to use our generous Companion Option. You only want to companion people you pay for or that you pod? Well, this is for you, I guess. Your Pods can now contain anyone or anything you can actually force into them... but you can’t free up a pod simply by asking the occupant if they want to be a companion. A Podpanion now remains bound to their pod until you release them, at which point they either Stay or Go Home. Podpanions don’t count against the 8 Companion limit, cannot make use of the Companion Bod Mod Pod, and don’t really count as Companions for things that specifically target companions, instead of counting as things in your Warehouse that just happen to (probably) be human-shaped. Once again, this is only for those who have their own companion rules and don’t want to use the ones below.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 109,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Pod Rack",
      "Cost": 200,
      "Description": "The Pod Rack starts with a single pod and you may use it to bring along any one individual from any world you visit. This individual does not have to be willing but you will have to find a way to get an un willing individual into the pod and they can’t be so powerful they can shatter the fairly sturdy pod from the inside. You must either force, trick, control, or convince someone to physically enter the pod, to pod them, but their size is no bar to them being podded. A good rule of thumb is that if you’d have to seriously exert yourself fighting the person, they’re too powerful to pod against their will. Podded individuals (Podpanions) do not count as Companions unless you make them Companions. If you make a Podpanion into a Companion (Something that traditionally must be done with their consent) the pod is freed up for future use. Note that this works on the assumption that anyone can be companioned if they say yes without the need for a pod of any kind. Paying CP for them just means they will say yes and get fiat backing immediately on you paying the CP for them. Since putting someone in a Pod does not make them a Companion, it is only really useful if you’re bringing someone along who would not say yes when asked. If you need a reason for these restrictions, realize that a NLF reading of the original pod would allow one to Pod any “person” without their permission or even coming into contact with them. Is God a person?",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 110,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Portal Aperture",
      "Cost": 100,
      "Description": "[Requires: Playing With Portals] You can now shrink your portals down to Planck scale or open them up to 8,000 square meters and increases the rate of expansion/contraction by a factor of 10. Additional Purchases will increase the maximum portal size to 80,000, then to 800,000, then to 8 million square meters. The expansion/contraction rate increases by a factor of 10 each time. The Portal shrinks to function ally no size, absolutely no size, and then conceptually no size. If you need it smaller than that, a fifth purchase will make it memetically as small as the number of fucks I give on the subject.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 111,
      "Prereq": true,
      "Prereq_Title": "Playing With Portals",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Portal Control Rod",
      "Cost": 200,
      "Description": "[Requires: Playing With Portals] Gives you a special device very much like a laser pointer that can be summoned instantly into your hand. Instead of having to directly physically touch a surface to open a portal, all you need to do is point at any appropriate surface and a portal will open at that location. To make a bigger portal, simply hold down the activation button longer. Handy if you’re running a kidnapping ring. The Rod works at up to 10 Kilometers distance.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 112,
      "Prereq": true,
      "Prereq_Title": "Playing With Portals",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Portal Link",
      "Cost": 300,
      "Description": "[Requires: Playing With Portals] Allows you to open a portal from inside your Personal Reality leading to anywhere in the current Host Reality that you’ve already been to. With this upgrade, you can now close the Personal Reality Door or Portal while inside your Reality and may open up to two portals at a time. Purchasing this does not include Key Link. Additional portals cost 100 WP each.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 113,
      "Prereq": true,
      "Prereq_Title": "Playing With Portals",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Power Overwhelming",
      "Cost": 400,
      "Description": "[Requires: Who’s Got the Powa] Not enough power? Okay, this upgrade means that your Personal Reality is now hooked up to the full power of a Sol-Class Star encased in a Dyson Sphere. Congratulations, you’re now a Kardashev II civilization. If this isn’t enough power, you need an intervention.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 114,
      "Prereq": true,
      "Prereq_Title": "Who’s Got the Powa",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Printing Precious",
      "Cost": 150,
      "Description": "[Requires: The Library Jumpxandria] Multiple Purchases Allowed. This magical machine can create perfect forgeries of any cultural relics you have images of or copies that are at least 51% complete. This can recreate historic texts (potentially in languages they were never written in)... and even edit the products so that they contain altered content. It cannot create copies of magical items unless you or someone in your crew possesses the ability to imbue the items it creates with the specific magical effect. Using this to make Tools or Weapons requires the Workshop or Arsenal Extensions. This machine isn’t particularly fast, as it aims for quality and perfection above all things, being able to turn out no more than a cubic meter of material every 24 hours... but the products it makes are absolutely in distinguishable from the real thing by anything less than divine power. Additional machines cost 20 WP or 300 CP.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 115,
      "Prereq": true,
      "Prereq_Title": "The Library Jumpxandria",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Prop Shop and Scenery",
      "Cost": 50,
      "Description": "[Requires: Entertainment Room] Need Props? Need random bits of furniture? Need back drops? Well, this will provide you with quasi-believable prop quality items for staging shows and performances. The more outlandish, the longer it takes to prepare, but most set-pieces can be made in a week or less. None of this stuff is “real” per se. The knives are rubber, the furniture designed to look good not be good, and the sets are functional but only as much as they need to be. Much of what this produces is made of foam and paint and plywood.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 116,
      "Prereq": true,
      "Prereq_Title": "Entertainment Room",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Realistic Ground Cover",
      "Cost": 50,
      "Description": "Sick and tired of linoleum or concrete? This is the one for you. Now your Personal Reality floor can be turned into any naturally occurring terrain type, in sections, or roads and paths of your design. Any dirt or dust that would be created by this is magic ally taken care of... unless you don’t want it to be.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 117,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Reality Extruder",
      "Cost": 100,
      "Description": "This allows you to manifest anything attached to your Personal Reality into the Host Reality, but doing so creates a physical link between the two realities that doesn’t require an Access Key to open. It could be a door in the back of a wardrobe, or a locked service closet, but if it’s opened, others will be able to come inside. This does not bypass any defenses you might set up, but anyone who enters via one of these links will be treated as baseline authorized by your force field unless clearly hostile. Anything extruded will be treated as native to the host reality even if it clearly couldn’t be (see lamp-posts in Narnia). Yes, this means you can have the entrance to your PR look like a Phone Booth if you have a phone booth in your Warehouse. Comes with a free phone booth. Ext ruder only works to the current Host Reality and you cannot connect to previous Host Realities through an Extrusion.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 118,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Recyclotron",
      "Cost": 200,
      "Description": "This option adds a matter recycler to your Personal Reality, which will break down any biological waste into compost, clean all water run through it, and transform any non-organics back into their basic compounds or elements. The Recyclotron can handle the waste output of a major city like Paris or Mumbai. If you have Maintenance Systems, they will dump garbage into it for you. The Recyclotron can also be set to jettison into the void any recycled matter over a certain amount so that you won’t have to deal with sixty gigatons of compost or plastic filament. Each 50 WP spent on this after the initial investment quadruples the hand ling capacity and material storage. Can’t dis pose of McGuffins in their native reality... or might, but also might explode.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 119,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Rooms for Cheap",
      "Cost": 0,
      "Description": "[Requires: Housing Complex] Multiple Purchases Allowed. If you feel you need more rooms for whatever reason, say to add a pillow lounge to every Apartment, you may purchase them here. Every purchase of this adds an additional room for every kitchen... but you don’t have to be even in the distribution. If you want a special guardsmen building, you could stick 10 rooms together to make a giant bar racks. Every fourth room for you, it also generates a bathroom. Every 200 rooms generated by any number of copies of Rooms for Cheap will generate an industrial food preparation venue (i.e. a mess hall). Unlike other options for Housing, if you choose not to assign these rooms to your main Housing, you can spin them off into their own extension or attach them to other extensions you might have as long as that extension allows storage.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 120,
      "Prereq": true,
      "Prereq_Title": "Housing Complex",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Second Reality",
      "Cost": 600,
      "Description": "If, for some reason, you feel you must have a second completely separate Personal Reality, this is for you. It includes everything that is free for the first one, but absolutely no WP is included and no Warehouse Extensions attach to it by de fault, nothing you buy for either Personal Reality applies to the other, and the two cannot be reached from each other unless both have Portal Link or Connecting Doors are used to link the two. Furthermore, all Limitations and Drawbacks apply equally to both Personal Realities, but do not provide the second Personal Reality with additional WP. Why you’d want this is entirely up to you, but frankly it’s probably a waste of points. If you think you’ve found a way to game this for some gain or end-run around some rule somewhere, it won’t work.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 121,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Sectional Time",
      "Cost": 200,
      "Description": "[Requires: Temporal Controls] This means you can now install fast or slow time chambers inside your Personal Reality. These can be anything from 1:100 to 100:1 and you are allowed to make use of them, but the time spent inside such an accelerated or decelerated chamber still counts only as the amount of time that passed in the host reality. Stasis still cannot be used while you’re inside the Personal Reality for obvious reasons. You age at the rate you’re personally experiencing time.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 122,
      "Prereq": true,
      "Prereq_Title": "Temporal Controls",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Security Personnel",
      "Cost": 200,
      "Description": "[Requires: (Security System && (Servant Quarters || Your Robots))] This upgrade provides your Personal Reality with security personnel, which ensures nothing untoward happens within your Personal Reality. To successfully execute their tasks they will have unlimited access to the entire extent of your Reality. Since they can only use equipment, anyone powerful enough to challenge you or your companions will probably trash them, but they should have a little problem with mooks, especially as they have access to your Arsenal. Security Personnel will not attack a Key holder.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 123,
      "Prereq": true,
      "Prereq_Title": "(Security System && (Servant Quarters || Your Robots))",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Security System",
      "Cost": 0,
      "Description": "Anybody coming in and out of your Personal Reality is now checked for any authorization you've given them to access it; and should anything about said authorization (or a lack of it) raise any flags in the system, then you will receive a warning about it. This allows you to define just what sorts of authorization different individuals can have to access your Personality Reality, anything from No Access through Temporary Access and Limited Access to Unlimited Access is possible. All this does is notify you. It does not stop them on its own. A Keyholder's Access cannot be limited by the Security System. Only hand out Keys to those you trust implicitly.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 124,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Seeds and Seedlings",
      "Cost": 50,
      "Description": "[Requires: Guardian’s Greenhouse] This Greenhouse Upgrade provides you with a package once a year that contains a random assortment of seeds and seedlings for you to plant in your Greenhouse. has enough seeds and seedlings to fill half of your Greenhouse and they’re chosen (and labeled) from all the Host Realities you’ve visited, though all are relatively normal plants for their Host Reality.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 125,
      "Prereq": true,
      "Prereq_Title": "Guardian’s Greenhouse",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Semi-Euclidean",
      "Cost": 50,
      "Description": "The space inside your Personal Reality is no longer exactly... normal. It’s not any bigger or anything, it’s just that everything seems bigger, more intriguing, less... confined by normal laws. Artificial hills become veritable mountains, dark corners become darker, otherwise straight hall ways twist in interesting ways. It’s all cosmetic of course, but it’s guaranteed to make everything seem grander, more mysterious, and more exciting. Don’t worry, it’s all perfectly safe... or as safe as it was before. Both in a physical sense and a spiritual one. No madness being induced by this.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 126,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Seraglio-A-Gogo",
      "Cost": 200,
      "Description": "Do you want an old fashioned Harem? Or just to have a place in your Personal Reality that looks like you might have a Harem? This is for you. A huge open courtyard surrounded by room-sized alcoves perfect for crafts and sleeping or maybe a little fun. The area is always pleasant, beautifully scented and full of soft music and laughter, and everyone in it always seems extra beautiful and well g roomed. It is a place of enjoyment and contemplation, a place to get away from the world, and time spent here relaxing always takes 1/10th the amount of real time that it seemed to take. Comes with a large central fountain that has water that smells of roses or honeysuckle and tastes as sweet as summer dew. The exact architecture and theming are customizable within reasonable limits.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 127,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Servants’ Quarters",
      "Cost": 100,
      "Description": "You now have a staff of utterly loyal, attractive, attentive, immortal, and utterly defenseless servants. How many? Enough to do the cooking, cleaning, and other household chores as you might assign them. Assume your number of Followers (Companions, Children, other Hangers on) plus 50%, minimum one. They’re fully competent but not exceptional in any way except for present ability and discretion. They never protest being mistreated and recover from any injuries within 6 hours. Upgrading them in any way turns them into companions. Unless upgraded, they don’t have souls and if you kill one, say to turn his body into a zombie, it will take a week for him or her to respawn, you necromantic weirdo.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 128,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Shell By Dyson",
      "Cost": 500,
      "Description": "[Requires: Personal Mini-Reality] Solar system a bit too big and a little too spread out for you? Well we got you covered, fam. Instead of the Sol System in its spread out form, you get it converted into a Dyson Shell with a radius of 1 AU, a mean internal surface gravity of 1g, and an internal surface temperature ranging from 56 C at the equator to -89 C at the poles and a twenty-four hour day night cycle. All of the temperature and daylight gradation are controlled by solar shades located at roughly Mercury’s old orbit that also soak up harmful radiation and solar ejecta. The interior surface is covered by tessellated copies of Earth’s surface across various epochs.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 129,
      "Prereq": true,
      "Prereq_Title": "Personal Mini-Reality",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Shelving",
      "Cost": 0,
      "Description": "Basic metal shelves to keep your goods on, the kind you find in industrial big box stores, sized for pallets and numbered for sorting. You'll get up to as many as will suit your initial space allotment, but if you don't take all of them, you'll need to buy more on your own… they sell them at most business supply warehouses, ironically enough.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 130,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Sky Simulator",
      "Cost": 50,
      "Description": "This replaces your boring drab ceiling with a completely realistic sky simulation... or a non-realistic sky simulation if you prefer the universe to look like something out of a Bosch painting. Since this means you won’t have a ceiling to attach anything to, all your lighting options now come with Street lamps. Note that this does not add any height to your Personal Reality.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 131,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Starting Collection",
      "Cost": 100,
      "Description": "[Requires: The Library Jumpxandria] Multiple Purchases only 50. Your library is now pre-stocked with all the books you would expect to find in an average town or school library, with a nice spread of texts on a variety of topics and in a language of your choice. This comes with 10,000 individual fiction titles and three times that number of non-fiction titles covering all normal real-world subjects. Most of the books will be best sellers or classics (80%) and will cover the last hundred and fifty years or so. The other 20% will be more esoteric works, but seldom anything particularly obscure or rare. In addition to scholarly works and literature, you’ll also get a periodicals section similar to that of a town library, containing several thousand as sorted magazines and newspapers, that will update with major print periodicals of each world you visit if they exist there. Each additional purchase (limit 5) increases the number of fiction and non-fiction titles by a factor of ten. This is the only Library Upgrade that includes fiction from ‘the real world’.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": true,
      "Discount_Title": "Starting Collection",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 132,
      "Prereq": true,
      "Prereq_Title": "The Library Jumpxandria",
      "Retake": true,
      "Retake_Cost": 50,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Starting Space",
      "Cost": 0,
      "Description": "Your Personal Reality starts out with a volume of 80×80×10 meters, so 6,400 square meters of floor space or 64,000 cubic meters of storage volume. In the archaic and silly 'Imperial' measuring system this translates to 262.5×262.5×32.8 feet, so 68,889 square feet or 2,260,138 cubic feet.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Starters",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 133,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 100,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement v1.3",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Stasis",
      "Cost": 200,
      "Description": "[Requires: Temporal Controls] This allows you to set chambers to total temporal stasis if you like... or set your entire Personal Reality to Temporal Stasis while you’re not there.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 134,
      "Prereq": true,
      "Prereq_Title": "Temporal Controls",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Storage Solutions",
      "Cost": 200,
      "Description": "{Requires: Shelving] Your Personal Reality now has a specialized set of construction au tomato ns which can produce the appropriate storage option for anything you know how to safely contain. These golems could make protective cases for your collectables, display cases for your pet universe, or just endless crates to stuff the preserved heads of everyone who has ever crossed you. All such storage items are fiat-backed never to weaken or wear out and can easily integrate any form of security you might have. All will be clearly labeled.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 135,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Tashi Station",
      "Cost": 200,
      "Description": "[Requires: Who’s Got the Powa] Did someone say ‘Power Converters’? This upgrade means that your generator now pumps out any esoteric energy type your Personal Reality’s equipment or city-like objects might need by converting some of its electricity into whatever, be that mana, anbaric power, natural gas, ether, the power of love, or the power of rock and roll. How, you ask? FIAT, BITCHES! (insert Air-Guitar Solo Here)",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 136,
      "Prereq": true,
      "Prereq_Title": "Who’s Got the Powa",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Temporal Controls",
      "Cost": 200,
      "Description": "This gives you control over how fast time flows in your Personal Reality while you’re not there. The de fault is 1:1, but with this you can dial it anywhere from 1:10 to 10:1. Remember, this doesn’t work when you’re in the warehouse.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 137,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Audacious Auditorium",
      "Cost": 50,
      "Description": "[Requires: Housing Complex] Adds an auditorium to your Housing Complex with a stage for bigger productions and comfortable seating for viewers. The Auditorium can seat up to 400 in comfort and the follow spots always follow, the lights always change on cue, and the props and sets are always in the proper order and condition. The acoustics are always perfect and the floor never sticky. If you have the Esplanade upgrade for your Housing Complex, the Esplanade gains its two more Auditoriums, and gains another every 6000 residents.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 138,
      "Prereq": true,
      "Prereq_Title": "Housing Complex",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Benefactor Lounge",
      "Cost": 0,
      "Description": "This installs a special room in your Personal Reality that exists for the sole purpose of meeting with your Benefactor. It has a limited wet-bar and the furnishings keep changing depending on where you’re going next. Head into Generic Western and it might be a Saloon, Head into Star Wars and it might be the Imperial Throne Room. Head in Monty Python and it might be a fish tank. This room exists for you to make builds in or ask questions. Your Benefactor is not guaranteed to be in all the time, but you could leave a note. They might even get back to you.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 139,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Better Bay",
      "Cost": 200,
      "Description": "[Requires: the Medical Bay] All medical issues are healed in a fraction of the time, without scarring, and the aches and pains fade within hours. You’ll be back on your feet by tea-time after having them blown off at breakfast. This can also bring back someone who is medically dead as long as their brain is still functional.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 140,
      "Prereq": true,
      "Prereq_Title": "the Medical Bay",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Big Garage",
      "Cost": 300,
      "Description": "[Requires: The Garage of the Gods] Have some vehicles that don’t exactly fit in the Garage? Say... The Enterprise? Light of Terra? Dahak? A Galacti World Ship? The Big Garage can handle it. You start with 4 drydocks, each large enough to house, well, anything. Each Additional Space purchase doubles the number of drydocks.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 141,
      "Prereq": true,
      "Prereq_Title": "The Garage of the Gods",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Big Hole",
      "Cost": 50,
      "Description": "This is a big hole (with a retractable cover) located somewhere in your Personal Reality. It leads to the limitless void. No living creature can pass through it. Anything that passes through it is gone. For Good. Even if CP backed. No guarantee it won’t end up in some random reality.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 142,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Big Pool",
      "Cost": 0,
      "Description": "[Requires: Pipes Pipes Pipes] An Olympic Water Park (diving pool, swimming pools, warm-up pools, etc.) is added to your Personal Reality. The pools upgrade with all the ne west tech if you have Central Control. If you have Choice Apartments and The Commons, each building gets its own SCM Pool. If you have 5 purchases of Downsizing, each House gets its own, smaller Pool (72m 2 footprint).",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 143,
      "Prereq": true,
      "Prereq_Title": "Pipes Pipes Pipes",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Bigger Pool",
      "Cost": 0,
      "Description": "[Requires: The Big Pool] This adds a lazy river and an entire in door beach complex to your A quadome. You know, as they have in Japan. Because those things are absolutely titanic, the footprint of this will not be taken from your available area unless you’ve bought three or more size up grades to your Starting Size. Don’t try to store things in here... they’ll get very wet and sandy.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 144,
      "Prereq": true,
      "Prereq_Title": "The Big Pool",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Bio-Synthesis Lab",
      "Cost": 100,
      "Description": "[Requires: Medical Bay] This upgrade covers all serums, viruses, bacteriological agents, and other chemical, genetic, or retro viral repair and boosting sciences, giving the results fiat-backing. Does not provide any knowledge base.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 145,
      "Prereq": true,
      "Prereq_Title": "Medical Bay",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Commons",
      "Cost": 600,
      "Description": "[Requires: Choice Apartments] It’s nice to have a place to meet and spend time with neighbors. This provides an in doors community area roughly the size of two full Apartments per 32 Apartments. Yeah, that’s at least 190 Followers. The Commons has a Restaurant Grade Kitchen, a stage, and fairly nice décor and furnishings. With Downsizing, the Commons becomes a shared facility across multiple Buildings.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 146,
      "Prereq": true,
      "Prereq_Title": "Choice Apartments",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Counseling Bay",
      "Cost": 200,
      "Description": "[Requires: the Medical Bay] And how does that make you feel? This upgrade helps you (or anyone else) work through any psychological issue. A couch, and solid light therapist are included, but not mandatory. This does not work instantly; more severe issues will require multiple hour long sessions spread over several months, no more than three a week (to allow for proper decompression and adjustment).",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 147,
      "Prereq": true,
      "Prereq_Title": "the Medical Bay",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Cybernetics Bay",
      "Cost": 200,
      "Description": "[Requires: (Medical Bay && Workshop)] This upgrade allows your Medical Bay to repair and replace damaged cybernetic and bio medical implants. All CyBay installed cybernetics have fiat backing.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 148,
      "Prereq": true,
      "Prereq_Title": "(Medical Bay && Workshop)",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Esplanade",
      "Cost": 1000,
      "Description": "[Requires: Opulent Apartments] It’s nice to have a place with little shops and cafes and maybe a riverfront? Well, if you have at least 4,560 Followers, buy this. The Esplanade is a boardwalk all the way around the entire Complex (there can be canals criss-crossing the complex, dividing it into sectors of roughly 3,000 Followers) and the river flows in a loop around the boardwalk. If you have The Pond, the river connects to it. The shops/cafes don’t run themselves, nor supply themselves but they’re completely move-in ready and range from fairly simple to upscale in the same proportions as your balance of Basic, Upscale, Luxury, and Opulent Units.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 149,
      "Prereq": true,
      "Prereq_Title": "Opulent Apartments",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Garage of the Gods",
      "Cost": 200,
      "Description": "A garage for you to place into your vehicles, automatically adjusting to meet their requirements. Any sort of land, air, or space-based personal vehicles (up to 12 meters long, 6 meters wide, and 4 meters tall). The Garage has berths for up to 40 such vehicles, with every purchase of Additional Space also increasing the number of berths by a factor of 5. The Garage comes with its own Vehicular Entry Hall (VEH) free of charge and a set of six adaptors that can turn garage doors (even non-automatic ones) into Personal Reality Portals. These adaptors take about five minutes to install and respond to the presence of a Key Holder by opening the way into their connected VEH. Each Additional Space purchase doubles the number of VEHs and adaptors. New adaptors are supplied at the start of each new jump and existing adaptors can be destroyed to break a connection. Destroyed adaptors respawn back in inventory 24 hours later. Adaptors are not hard to destroy, even by mortals, and they are fairly obvious black boxes about the size of a sandwich. If you also have the Pond, this installs a Marina which comes with special adaptors for boat slots. Boat slots do not worry about the draft or masts of the boats you park in them, only the distance from the waterline to the top of the primary hull.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 150,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Library Jumpxandria",
      "Cost": 100,
      "Description": "A place to keep all the books and writings you and your companions might create or gather throughout your adventures, with all of them kept in pristine condition and automatically sorted based on your selected scheme, no matter how harebrained. Comes with a reading area that has the effect of slightly boosting concentration, reading speed, comprehension, and retention rate.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 151,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Loft",
      "Cost": 0,
      "Description": "What’s the point of having a room 10 meters tall if you can’t build up wards? Feel free to stack things up to the ceiling if you like.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 152,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Mall of Mystery",
      "Cost": 200,
      "Description": "[Requires: Mall of All] Sick of boring “normal” stores? Well, your Mall just got a serious (and seriously weird) upgrade. It now manifests a range of specialty shops that (in theory) might sell anything that could be for sale in any reality you’ve ever visited. These shops are never easy to find and seem to hide, close spontaneously, and move when you’re not loo king. Your mall becomes noticeably larger and more maze like. Sometimes monsters appear here. They might be shopping. They might be hunting.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 153,
      "Prereq": true,
      "Prereq_Title": "Mall of All",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Meaning of Life",
      "Cost": 100,
      "Description": "[Requires: The Pond] This upgrade adds fish and shellfish and pond weed/sea weed to your pond. Also the occasional duck or swan or other waterfowl. Maybe some frogs or lizards or small reptilians, but nothing dangerous... unless you bought a specific limitation.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 154,
      "Prereq": true,
      "Prereq_Title": "The Pond",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Medical Bay",
      "Cost": 100,
      "Description": "This can treat all medical or dental issues on anyone that still has a pulse or equivalent. Provides detailed accounting of a person’s medical history. Will not repair genetic defects or replace/repair cybernetics and cannot differentiate between beneficial and harmful nanites or implants on its own. Works on animals as well. Being fixed up takes anywhere from one hour to a solid week depending on the degree of damage, and you’ll still need physical therapy, haves cars, and be all achey.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 155,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Microbiome Replacement Lab",
      "Cost": 100,
      "Description": "[Requires: Bio-Synthesis Lab] This upgrade allows you to create a special serum that inoculates anyone of any species so that the symbiotic life forms that their bodies need to continue functioning are replaced with benign versions of themselves that won’t harm them if they go out of whack nor will they infect others for whom they won’t be so symbiotic. This isn’t just limited to helpful bacteria, protozoa, and fungi, but also applies to things that might not technically be alive like virus particles that are part of your virome or self-replicating nanites/picocites.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 156,
      "Prereq": true,
      "Prereq_Title": "Bio-Synthesis Lab",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Mystical Menagerie",
      "Cost": 200,
      "Description": "During your Jump chain adventures you will undoubtedly acquire a plethora of animals, be they pets, mounts, or livestock. Everything from dogs and cats to horses, oxen, emu, or chocobos... Unfortunately, such animals need space... often a great deal of it. Well, this improvement provides your Personal Reality with a nearly perfect place for each of them to go and a steady supply of feed and drink. Each Animal receives a spacious living area in your Menagerie, something large enough and varied enough that they’ll be able to exercise and amuse themselves. While this area is not boundless, and it cannot be used for storage or exploited for resources, it will mimic their natural environment and can cover dozens or hundreds of square Kilometers. Multiple animals can share an environment if they, in fact, can share an environment (zebras and lions for instance). The area of your Menagerie is not taken from your Starting Size and is completely separate, but each purchase of Additional Space increases the total number of environments by 10 and you start with 10, each of which maxes out at the size of Portugal.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 157,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Nano-Medical Lab",
      "Cost": 100,
      "Description": "[Requires: Medical Bay] The Medical Bay can now tell exactly what every nano scale contaminant inside a living body does and, option ally, remove them without causing harm to the host. The NML can also replicate and administer Medical and Augmentation nanites as long as you have the materials and requisite know-how. All NML administered nanites have fiat-backing.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 158,
      "Prereq": true,
      "Prereq_Title": "Medical Bay",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Pond",
      "Cost": 100,
      "Description": "One of the four walls of your Personal Reality has been replaced with a water feature. This is essentially a pond, but you can give it t ides and or waves, make it fresh or salty, and give it a beach if you like. If you buy the Garage option, it comes with a Marina for your boats and a second entry zone so you can drive your boats out into the host reality. For 50WP each, can be expanded to additional walls.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 159,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Quadrangle",
      "Cost": 800,
      "Description": "[Requires: Luxury Apartments] It’s nice to be able to get outside and do stuff as a community. This provides a park area roughly four times the size of a 32 Apartment Building per 128 Apartments. That’s at least 760 Followers. Even if you haven’t purchased the appropriate PR facilities, the Quadrangle automatically has a day-night cycle, fourteen day standardized weather cycle (3 days of winter, 4 days of spring, 3 days of summer, 4 days of autumn), and naturalistic foliage set by the community of the buildings surrounding it. The Quadrangle grows 20% larger with each level of Downsizing, compounding, not additively.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 160,
      "Prereq": true,
      "Prereq_Title": "Luxury Apartments",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Question of Shelving",
      "Cost": 0,
      "Description": "Basic metal shelves to keep your goods on, the kind you find in industrial big box stores, sized for pallets and numbered for sorting. You’ll get up to as many as will suit your initial space allotment, but if you don’t take all of them, you’ll need to buy more on your own... They sell them at most business supply warehouses, ironically enough.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 161,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Reality Development Board",
      "Cost": 200,
      "Description": "Do you want something specific built within your Personal Reality, or modifications made to that hotel you bought last jump? Do you need help relocating the contents of your in-jump home into your Personal Reality? Maybe you picked up an awesome jacuzzi, but lack the skills needed to install it? Well, worry no more! This is your one stop shop for Zoning, Planning, Construction, Moving, and Installation! Our Team are fully capable of drawing up the necessary plans, measuring everything, constructing anything you’ve got blue prints and parts for, moving whatever you need moved (well as long as you own it), installing whatever you need installed. This team is always just big enough to complete your projects in a reasonable amount of time, summoning members from parallel realities, though they are no more individually powerful than the average human construction worker. You will need to provide them with access to tools and supplies, but purchases such as Workshop can help with that. They can install copies of any property related items you buy into whichever proper ties you own, update any existing properties as needed, and merge various proper ties together into a seamless and harmonious whole.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 162,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Semi-Secret Garden",
      "Cost": 50,
      "Description": "A garden for your Personal Reality, a small place (roughly the size of K ew Gardens in London... i.e. 300 acres) filled with aesthetically pleasing flowers, bushes, trees, and decorations like fount a ins and garden gnomes. Comes with benches for you to sit on and relax, with birds singing from branches and butterflies fluttering around. Perfect for a bit of a break away from the hassle of busy life. It is self-sustaining and always pleasant. Without the Sky Simulator, this place is always in a perpetual twilight. With the Sky Simulator, this place will have occasional interesting weather phenomenon, like fog or simulated meteor showers or spring frost. All very unpredictable.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 163,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Titan’s Mall",
      "Cost": 100,
      "Description": "You now have an entire mall in your Personal Reality, which starts out with 15 average-sized shops. These shops include at least one bookshop, one pet shop, one drug store with a pharmacy, three clothing stores, one shoe store, one computer and games shop, one grocery store, and one fast food restaurant. You can pick the general theme of the five remaining shops within the mall yourself or leave it to chance. Merchandise sold in these shops is comparable to merchandise normally sold in shops in your current jump. Any currency available in your current Host Reality is required to make purchases in these shops. The mall is kept clean and filled with merchandise by an automated system, unless you’ve purchased Servant Quarters, in which case it gets staffed by additional servants.... alternatively, if you and your companions have children, you may require them to staff the shops to earn an allowance. The shops will be relatively mundane, but could be from any reality you’ve visited or your own Origin Reality. A shop from one Host Reality may be locked in so that it won’t change when you leave that Host Reality. If you ever decide to change it, that shop will close immediately and a new one will take its place at the start of your next jump. All such stores have limited daily stock, and no storage space for more... but they’ll restock popular items daily and less popular items weekly. If something doesn’t sell, they’ll eventually stop carrying it, but there is never a ‘oh, you buy this much often! We jack up price!’ function. If you’re an ass, you can charge everyone who isn’t you a tax on anything they buy here.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 164,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "The Village",
      "Cost": 0,
      "Description": "[Requires: (Sky Simulator && Realistic Ground Cover && (Treeline and Timber || The Pond))] Your Personal Reality now looks like a town in the middle of the woods, or in a mountain valley, or on a cliff side or seaside/lakeside. Not only that, but you can divide up sections of Warehouse by placing paths or bits of forest or water between them. This includes all Personal Reality expansions you buy, so if you want your Olympian Temple on an island off the coast of your village, that’s fine. The dividing space can be up to 100x the total footprint of your Personal Reality space, but dividing zones and paths can’t be used to store stuff... It’s purely aesthetic.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 165,
      "Prereq": true,
      "Prereq_Title": "(Sky Simulator && Realistic Ground Cover && (Treeline and Timber || The Pond))",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Theme Park",
      "Cost": 250,
      "Description": "Would you like an amusement park in your Personal Reality? Of course you would! Who wouldn’t?! No, this isn’t one you get to design, nor one you can charge admission to. It also doesn’t really add to your Reality’s footprint per se. What it does is add one attraction (ride or interactive exhibit) and a souvenir stand for each jump you visit. Nothing at the stand is more than completely mundane tourist collectables and themed snacks. If you jump to a setting you’ve already got an attraction for, you gain a restaurant or café or pub themed around it instead. A third jump in a single setting adds costumed NPCs wandering around being “in character” and fun to interact with. They are harmless and won’t break character. A fourth jump to the same setting adds collectable tradable pins for that setting. The NPCs always have a selection and rare pins are actually rare. There’s no way to game the rarity, but it’s always one pin for one pin (at least from the NPCs). Attempts to duplicate these completely mundane pins results in an ugly frowny face pin. A fifth jump to the same setting adds another attraction, a sweet shop or some other atypical food venue, and a hotel that randomly generates visitors to the theme park. These visitors are completely normal (we promise) people from any of the settings you’ve been to and do not realize they’re in an extra-dimensional super reality. They will (usually) respect any signs you place up indicating that an area is restricted. They cannot bypass the PR’s Security System if you’ve bought it, so you can keep them in the park area that way. The NPCs don’t leave the park area. For a discount of 150 WP, the Park will get to establish its venues wherever it wants in your Personal Reality. You will not be able to move the Park Buildings and the NPCs will wander everywhere.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 166,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Treeline and Timber",
      "Cost": 200,
      "Description": "Walls getting you down? Well, you’re in luck. Not only does this replace your walls with trees, there’s actually a bit of a forest out there. Not usable for storage, but you can walk through the woods or cut down trees at the edge of the line for lumber or firewood. Any trees cut down regrow overnight and the stumps can never be cleared. You can walk as far into the woods as you like, but you’ll eventually come out on the other side of your Personal Reality. The trees are a mix of common trees from Earth and you can customize them to your liking with sliders to control how many pines, oaks, poplars, palms, apple trees, etc. The trees will naturally cycle through a year over the course of a year. Any tree you gain seeds for can be added to the mix, if you can provide whatever nutrients they need.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 167,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Underside",
      "Cost": 100,
      "Description": "[Requires: Lofty Loft] This allows you to create Basement Spaces in your Personal Reality. The maximum volume of all ‘underground’ spaces is equal to ½ the volume of your Personal Reality, but these spaces need not be contiguous. Connections such as chutes, corridors, or elevator shafts are not counted for that total unless you start trying to cheese it by creating an infinitely long corridor to store things in.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 168,
      "Prereq": true,
      "Prereq_Title": "Lofty Loft",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Unique Servants",
      "Cost": 50,
      "Description": "[Requires: Servants’ Quarters] By de fault your servants are soulless humans, but with this upgrade to Servants’ Quarters you can make them into any type of servants that you want-fleshy homunculi, zombies, metallic robots, animated teddy-bears, house elves, anything is allowed, even mix and match different types. Just keep in mind that they remain soulless and can’t be in any way exceptional except for present ability and discretion. This holds true even if you upgrade them into companions, so no u sing this as a shortcut to get house elves with their exceptional wand less magic. Once upgraded to companions, any improvements are on you and are limited by your abilities or what you allow them to buy with CP, just like any other companion.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 169,
      "Prereq": true,
      "Prereq_Title": "Servants’ Quarters",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Upscaling",
      "Cost": 100,
      "Description": "[Requires: Housing Complex] Living in featureless boxes is... well, it can be... problematic for a lot of people. Sure, each of these up grades can be had from elsewhere in this Supplement and cover all the Personal Reality, but they all cost more (sometimes a lot more), but this may be more economical for you. Each purchase of this provides three options from the following list of “simulations of reality”, be that quasi-natural day-night cycles, naturalistic humidity levels, simulated wind, basic naturalistic views, improved naturalistic views, sights and smells of nature, etc. These only apply to the Housing Complex’s area. Each is fairly self explanatory. You can also use one option to create a new “Zone” which has different settings on all other purchased simulation options from the first. Zones may also pick the options “Altered Gravity” or “Variant Atmospheric Composition” if you happen to have Followers who aren’t exactly from Earth, shall we say. The results of these simulations aren’t as good as the full versions elsewhere in this document, and don’t apply to any other part of your Personal Reality. The Views in particular are completely fake. Up grades from this also apply to Basic Accommodations, if you have that.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 170,
      "Prereq": true,
      "Prereq_Title": "Housing Complex",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Voice Over Warehouse Protocol Cellular Service",
      "Cost": 200,
      "Description": "[Requires: Digital Extranet] This hooks your Personal Reality up with V.O.W.P Cellular Service, and provides you with fiat backed cell phones that are guaranteed to connect to the Personal Reality or to any other cell phone on the service... regardless of what Reality those phones are connected to at the current moment. You gain a vending machine that vends Nokia dumb-phones, iPhones up to 8, and Galaxy S7 smart phones, plus any cell phone (or similar) you supply it with a copy of, as well as SIM cards or the equivalent for other phones. These phones will work just fine no matter where you find yourself, but be careful as they’re just as durable as normal ones and will need to be replaced should they get damaged or destroyed. They must be charged as normal, but get extremely good battery life.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 171,
      "Prereq": true,
      "Prereq_Title": "Digital Extranet",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Watch Your Arsenal",
      "Cost": 200,
      "Description": "placing your battle armor and sword right next to your wedding dress rarely appears all that practical, so with this purchase an armory gets added to your Personal Reality, into which you, your Companions, and your Followers can place your battle armors and your weapons. Content placed into the armory will be sorted for easy access and will be kept in pristine condition, always cleaned when returned to it, and all minor damage automatically repaired, although more serious (structural) damage you’ll have to sort out for yourself. The armory will reload/recharge your weaponry for you, assuming you have access to the appropriate materials or said materials are relatively common. You may set access limits on some or all of the armory. Despite the name, it’s not necessarily a single structure. This can, in fact, be multiple distributed structures, as it is designed to suit your weapons storage and distribution needs. If you have Portals, any Key Holder can summon their equipment through any portal they open. You are, of course, automatically a Key Holder. If you have the Housing Complex, every Building gets a distribution point (weapons locker) and every Apartment has a weapon’s safe. In the name of safety, all Arsenal weapons lockers of any kind are guaranteed childproof, pet proof, and (if you have the Counseling Bay) unhinged lunatic proof. A Key Holder can grant an override to these lock outs for specific individuals for specific weapons of course, so if you’re an unhinged lunatic child, you won’t be locked out of your own arsenal.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 172,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Water World",
      "Cost": 300,
      "Description": "[Requires: Pipes Pipes Pipes] This upgrade provides you with all the water you’ll ever need. Every day this massive Hydro core Tap can generate enough H2O in any natural form to cover Luna in seas 10 meters deep... let’s call it 500,000,000 cubic Kilometers of water. Of course, throughput is going to be a bitch, so the Hydro core comes with a Global targeting computer and up to a million hoses each capable of pumping out 500 cubic Kilometers of water a day... or 5.8 million tons of water a second... or 29 times the flow rate of the Amazon River... each. If this isn’t enough water for you, you might be obsessed, or making a star.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 173,
      "Prereq": true,
      "Prereq_Title": "Pipes Pipes Pipes",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Wellness Center",
      "Cost": 50,
      "Description": "This provides your Personal Reality with a size-adjustable complex in which you and your companions, followers, and h anger s-on can enjoy private or semi-private mass ages and other types of spa pampering. It’s fully equipped with all the most useless and pointless ‘therapy’ types, but it requires the purchase of Servant Quarters to keep it staffed, otherwise you’ll need to come up with your own solution to get it staffed. This requires Environmental Controls, Water, and Electricity.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 174,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Who’s Got the Powa",
      "Cost": 100,
      "Description": "This provides enough electricity to power a city the size of New York City or London, forever, with nary a brown out or power fluctuation ever. It also comes with all the basic wiring hookups, surge protectors, out lets, circuit-breakers, routers, etc. you might need... but you’ll probably want to get a qualified electrician in at some point... or pick up a companion who does that kind of thing. Purchase of this supplies all facilities inside your Personal Reality with electrical hookups.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 175,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Wide Berth Expansion",
      "Cost": 100,
      "Description": "[Requires: The Garage of the Gods] Multiple Purchases Allowed. Each purchase of this boosts each parking berth’s dimensions by a factor of 2. (24mx12mx8m, 48mx24mx16m, 96mx48mx32m, etc.)",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 176,
      "Prereq": true,
      "Prereq_Title": "The Garage of the Gods",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Wildlife for Your Wild Life",
      "Cost": 100,
      "Description": "[Requires: Treeline and Timber] This upgrade adds in small forest creatures like rabbits, squirrels, wolves, and bears. Ferrets too, but they’re not actually wild-animals... except the black-foot ferret, which is. Oh, yeah. birds too, I guess. And bugs... but only mostly harmless ones. Bees yes, Wasps no. If you add at least 10 males and 20 females of any moose-sized or smaller species to the system, they will be added in and balanced accordingly. non-magical species only.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 177,
      "Prereq": true,
      "Prereq_Title": "Treeline and Timber",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Windows",
      "Cost": 50,
      "Description": "Rooms in your Personal Reality receive windows that look out onto some scenery of the current Jump. The view can be customized per room, but can’t be used for spying purposes or to view private moments.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 178,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Windows of Nostalgia",
      "Cost": 50,
      "Description": "This Windows Upgrade now lets you set Windows to show scenes from previous jumps, although limited to views that happened during those Jumps’ durations, nothing that happened before or after wards.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 179,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Workshop",
      "Cost": 100,
      "Description": "Multiple Purchases Allowed. Each purchase of this adds a new and specialized Workshop to your Personal Reality. Each is customized to the performance of a specific type of craft or hobby, which is to be specified when the purchase is made. It comes with a basic set of tools and supplies. Good for fixing or creating all sorts of things, although any complex parts or nonstandard supplies will have to be brought in from outside. Additional purchases can add different types of Workshops to your Personal Reality or expand existing ones. Anything built in one of those workshops is fiat-backed to be restored to its original condition within 48 hours if damaged or destroyed. All tools you add to a Workshop become self-repairing.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 180,
      "Prereq": false,
      "Prereq_Title": "",
      "Retake": true,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    },
    {
      "Title": "Your Robots",
      "Cost": 200,
      "Description": "[Requires: Central Control] This upgrade provides you with an automated sorting system that sorts and automatically retrieves anything stored in your Personal Reality. These Robots are completely upgradeable and programmable, so you can keep them out of key areas or tell them not to disturb certain potentially explosive experiments if you want. You get twenty of them and instructions on how to make more.",
      "Dice": "1d1",
      "Discount_Cost": 0,
      "Discount_Multiplier": 0.5,
      "Discount_Req": false,
      "Discount_Title": "",
      "Domain": "Supplements",
      "Domain_Number": 0,
      "Free_Req": false,
      "Free_Title": "",
      "Lewd": false,
      "Perk_Number": 181,
      "Prereq": true,
      "Prereq_Title": "Central Control",
      "Retake": false,
      "Retake_Cost": 0,
      "Retake_Count": 0,
      "Retake_Multiplier": 1,
      "Retake_Times": 0,
      "Source": "Personal Reality Supplement",
      "Upper_Source": "Personal Reality Supplement",
      "Taken": false
    }
  ]
}